{
"text": "BiomedXPro: Prompt Optimization for Explainable Diagnosis with Biomedical\n                                  Vision Language Models\n\n\n                  Kaushitha Silva*               Mansitha Eashwara*         Sanduni Ubayasiri*\n               University of Peradeniya           University of Peradeniya      University of Peradeniya\n                Peradeniya, Sri Lanka             Peradeniya, Sri Lanka        Peradeniya, Sri Lanka\n               e19372@eng.pdn.ac.lk            e19094@eng.pdn.ac.lk       e19408@eng.pdn.ac.lk\n\n                      Ruwan Tennakoon                 Damayanthi Herath\n                     RMIT University                  University of Peradeniya2025                          Melbourne, Australia                 Peradeniya, Sri Lanka\nOct                  ruwan.tennakoon@rmit.edu.au       damayanthiherath@eng.pdn.ac.lk\n17                     Abstract                             as cellular morphology, tissue architecture, and patholog-\n                                                                                     ical patterns, combined with domain expertise, to make\n          The clinical adoption of biomedical vision-language mod-     informed diagnostic decisions.  For computer vision sys-\n             els is hindered by prompt optimization techniques that pro-     tems to achieve clinical acceptance, they must not only\n          duce either uninterpretable latent vectors or single textual     demonstrate high predictive accuracy but also provide in-\n           prompts. This lack of transparency and failure to capture      terpretable outputs that align with established clinical rea-[cs.CV]     the multi-faceted nature of clinical diagnosis, which relies     soning processes.\n          on integrating diverse observations, limits their trustworthi-                                                                     Recent advances in Vision-Language Models (VLMs),\n           ness in high-stakes settings. To address this, we introduce                                                                                particularly  Contrastive  Language-Image  Pre-training\n          BiomedXPro, an evolutionary framework that leverages a                                                                 (CLIP) [14], have demonstrated remarkable potential for\n            large language model as both a biomedical knowledge ex-                                                                         bridging visual content with natural language descriptions.\n            tractor and an adaptive optimizer to automatically gener-                                                                   Biomedical adaptations such as BiomedCLIP [21] extend\n            ate a diverse ensemble of interpretable, natural-language                                                                           these capabilities to medical imaging domains.  While\n          prompt pairs for disease diagnosis. Experiments on multi-                                                         CLIP models demonstrate strong zero-shot capabilities,\n            ple biomedical benchmarks show that BiomedXPro consis-                                                                                    their performance often benefits from prompt optimization\n             tently outperforms state-of-the-art prompt-tuning methods,                                                                                 tailored to specific tasks. Early attempts relied on manual\n            particularly in data-scarce few-shot settings. Furthermore,                                                                prompt engineering [14], which was labor-intensive and\n          our analysis demonstrates a strong semantic alignment be-                                                                          required domain expertise. To overcome these challenges,\n          tween the discovered prompts and statistically significant                                                                         gradient-based prompt learning methods such as Con-\n             clinical features, grounding the model’s performance in                                                                                   text Optimization (CoOp) [24] introduced learnable soft\n             verifiable concepts. By producing a diverse ensemble of in-                                                                  prompts  represented  as  continuous  vectors  optimizedarXiv:2510.15866v1     terpretable prompts, BiomedXPro provides a verifiable ba-                                                                           via gradient descent.  Biomedical adaptations, including\n              sis for model predictions, representing a critical step toward                                                       BiomedCoOp [10] and XCoOp [1], incorporated domain\n            the development of more trustworthy and clinically-aligned                                                               knowledge into CoOp frameworks to improve performance.\n          AI systems.\n                                                                         Despite these advances, two critical challenges remain\n                                                                               for clinical adoption: (1) prompts used to guide these mod-\n           1. Introduction                                                 els are typically optimized as uninterpretable feature vec-\n                                                                                      tors, providing no insight into the underlying diagnostic ra-\n           Accurate and transparent interpretation of biomedical im-      tionale [1, 3, 10], and (2) existing methods generally pro-\n           ages is fundamental for reliable disease diagnosis. In clin-     duce singular prompts, restricting their ability to capture\n             ical practice, radiologists, pathologists, and other medi-      the multifaceted nature of clinical observations that practi-\n            cal specialists rely on well-established visual cues such      tioners routinely consider.\n\n                *Equal contribution                                           Large Language Models (LLMs) present a compelling\n\n\n                                                           1\n\nsolution to these limitations.  They can generate seman-      limitations, domain-adapted models such as MedCLIP [18],\ntically meaningful, natural-language prompts that encode    PubMedCLIP [4], and BiomedCLIP [21] have been devel-\nbiomedical knowledge and can be automatically refined to     oped. These models, by incorporating biomedical-specific\nenhance diagnostic performance [20, 25]. However, exist-      pretraining strategies, have demonstrated superior perfor-\ning LLM-driven prompt optimization techniques still oper-    mance on biomedical tasks.\nate largely as black-box systems, with limited mechanisms       BiomedCLIP, trained on over 15 million biomedical\nto ensure clinical transparency or domain relevance.            image-text pairs with a PubMedBERT encoder, has notably\n   In this work, we introduce BiomedXPro, an evolution-      established state-of-the-art results across multiple biomed-\nary prompting framework specifically designed for biomed-      ical vision-language benchmarks.  While  it offers strong\nical disease diagnosis.  Unlike conventional methods that     zero-shot performance, its effectiveness can be further en-\nseek a single optimal prompt, our framework evolves a di-     hanced by adapting it to specific tasks. This is where prompt\nverse ensemble of human-readable prompts, each captur-     tuning becomes critical, as  it efficiently tailors a frozen\ning distinct diagnostic observations.  These prompts may   VLM for a new task without full model fine-tuning. This\nemphasize specific morphological alterations, tissue orga-     method involves optimizing a text prompt or its token level\nnizational patterns, or cellular-level abnormalities that are      representation to guide the model toward the most relevant\ndirectly interpretable by clinical practitioners. We lever-     information, thereby capturing the fine-grained, disease-\nage LLMs both as biomedical knowledge extractors and as      specific nuances that are essential in clinical applications\nadaptive optimizers that iteratively refine prompts through     and enhancing performance even in low-data settings.\nstructured feedback mechanisms, ensuring that the final\nprompt ensemble captures a comprehensive range of clin-     2.2. Limitations of soft prompt tuning\nically meaningful features.                                                              Soft prompt tuning methods, which learn textual tokens ap-\n  Our approach delivers three key advantages for clinical                                                      pended to natural-language prompts, offer lightweight al-\nintegration:                                                                   ternatives to full model fine-tuning.  Context Optimiza-\n1. Interpretability: Each optimized prompt corresponds      tion (CoOp) [24] introduced learnable soft prompts opti-\n   to a clear, medically grounded observation, providing     mized via gradient descent under a frozen CLIP backbone.\n   transparency into model decision-making processes and     However, soft prompts often remain uninterpretable and\n   enabling clinical validation.                        may overfit in low-shot settings, limiting their applicabil-\n2. Diversity:    Maintaining  multiple  complementary      ity in high-stakes biomedical contexts where explainability\n   prompts mirrors the multi-perspective approach  that       is paramount. While recent adaptations like BiomedCoOp\n   clinicians  naturally  employ when  evaluating  diag-     [10] and XCoOp [1] incorporate LLM-generated knowl-\n   nostic  evidence,  enhancing  model  robustness  and     edge to improve performance and guide the learning pro-\n   generalization capabilities.                                     cess, they still fundamentally rely on uninterpretable soft\n3. Clinical Trustworthiness: Probabilistic predictions are     prompts.  Despite their advancements, the final learned\n   anchored in semantically meaningful medical concepts,     prompts in these methods lack the true human-readability\n   facilitating their integration into established diagnos-     necessary for transparent and trustworthy clinical applica-\n    tic workflows and supporting evidence-based clinical      tions.\n   decision-making.\n                                                               2.3. Hard prompt tuning  By combining the adaptability of vision-language mod-\nels with interpretable, LLM-driven prompt evolution, our     While soft prompts offer efficiency, their lack of trans-\nframework goes beyond conventional accuracy-focused ap-     parency limits their use in clinical settings. Hard prompt\nproaches and directly addresses the fundamental barriers to      tuning, which optimizes explicit text strings, improves in-\nsafe and trustworthy deployment of AI systems in clinical      terpretability but relies heavily on manual design and do-\ndiagnostic environments.                                main expertise. To overcome this, recent methods lever-\n                                                        age LLMs for automated prompt generation. Approaches\n2. Related work                                       such as APE [25] and OPRO [20] treat prompt design\n                                                              as a black-box optimization problem, while frameworks\n2.1. VLMs in biomedical imaging                                                                      like EvoPrompt [7] and PromptBreeder [5] integrate evo-\nVLMs like CLIP [14] have revolutionized multi-modal      lutionary algorithms to iteratively refine prompts, achieving\nlearning by aligning images and text through contrastive      stronger generalization than manual engineering.\npre-training, enabling strong zero-shot capabilities. How-       These techniques have been extended to VLMs, with\never, their direct application to the biomedical domain is     works such as Liu et al.  [11] and IPO [3] demonstrating\nchallenged by specialized terminology, subtle visual mark-      that interpretable, LLM-generated prompts reduce overfit-\ners, and the scarcity of labeled data [22]. To overcome these      ting and improve transferability compared to gradient-based\n\n\n                                                 2\n\nCoOp. Evolutionary approaches like ProAPO [13] further     where sim(x, p) denotes the ℓ2-normalized cosine similar-\nimprove efficiency by refining prompts through mutation       ity.\nand crossover while limiting repeated LLM queries.\n   Despite their promise, direct adaptation to biomedical     3.2. Evolutionary prompt optimization\nimaging remains challenging. Many methods assume ac-   We formulate prompt discovery as a multi-objective op-\ncess to large general-domain corpora or rely on multimodal      timization problem that balances classification accuracy,\nLLMs that struggle with biomedical specificity.  More-     which measures the collective performance of hj Kj=1 on the\nover, constraints such as limited initial prompt diversity      training set, with prompt diversity, which mitigates seman-\n(e.g., ProAPO) and incomplete integration of insights from       tic redundancy by penalizing similar prompts in the text em-\nbroader prompt optimization research (e.g., handling re-     bedding space. To address this problem, we propose an evo-\ncency bias, scoring formats) highlight open opportunities      lutionary algorithm that operates directly within the VLM\nfor advancing interpretable prompt tuning in BiomedCLIP     embedding space and uses LLMs to generate semantically\nand related models.                                      grounded prompt mutations. An overview of the proposed\n                                                      framework is shown in Figure 1, and the components of the\n2.4. Explainability in biomedical CLIP models\n                                                            algorithm are described below.\nInterpretability remains critical for clinical adoption. Exten-\nsions such as XCoOp [1] and BiomedCoOp [10] improve\n                                                                    Initialization.  We begin with a meta-prompt Q0 that en-\ntransparency by incorporating clinical knowledge extracted\n                                                         codes key diagnostic observations, which is used to initial-\nvia LLMs, yet the learned soft prompts remain latent vec-\n                                                                   ize the first-generation population:\ntors with limited human readability.\n  An  alternative  is  descriptor-based prompting,  as  in                       (0)                                                P  = {(p−j , p+j )}K0j=1,  p±j ∈T ,         (3)\nXplainer [12], which classifies images based on structured\nradiological observations (e.g., “There is/are [no] [obser-                                                     where p+j specifies a disease-related observation and p−j de-\nvation] indicating [pathology]”).  This offers inherent in-\n                                                              notes its absence. The meta-prompt Q0 template is as fol-\nterpretability, but its effectiveness depends on initial LLM-                                                             lows:\ngenerated prompts and extensive manual engineering by do-\nmain experts, making it difficult to generalize across diverse        Give <K0> distinct textual\nbiomedical tasks.                                       descriptions of pairs of visual\n                                                    discriminative features to identify\n3. Methodology                                     <task description>.  Only provide\n                                                    the output as Python code in\n3.1. Problem formulation                              the following format:  prompts =\n                                                    list[tuple[negative:  str, positive:Given a biomedical dataset D = {(xi, yi)}Ni=1 with medical\nimages xi ∈RH×W ×C and binary labels yi ∈{0, 1}, we        str]].\naddress the challenge of learning interpretable visual con-\n                                                           Here, <K0> is the desired population size and <taskcepts for disease classification. We leverage a pre-trained\n                                           description>  is  instantiated  for  each  task  (e.g.,VLM with an image encoder fθ  : RH×W ×C →Rd and a\n                                                   ”melanoma in dermoscopy images”)text encoder gϕ : T →Rd, which project visual and textual\ninputs into a shared d-dimensional embedding space.\n  Our goal is to discover a set of K semantically meaning-     Fitness evaluation & population update.  Each prompt\nful prompt pairs:                                                  pair (p+j, p-j) is evaluated on the training set:\n\n       P = {(p−j , p+j )}Kj=1,  p−j , p+j ∈T ,         (1)                                                                              sj = M  {hj(xi), yi}xi,yi∈D   .           (4)\nwhere p+j  describes the presence of disease-indicative vi-                                                     where M : {0, 1}N ×{0, 1}N →R is a performance metric\nsual observations and p−j describes their absence or normal                                                                             (e.g., accuracy, F1, or inverse binary cross-entropy).\nappearance.\n                                                       Prompt pairs with sj ≥α are retained in a memory\n                                                                 buffer\nClassification via prompt pairs.  For each prompt pair                   U(t) = {(p−j , p+j , sj) | sj ≥α},           (5)\n(p−j , p+j ), we define a binary classifier based on cosine sim-\nilarity in the shared embedding space:                      which aggregates high-performing prompts across genera-\n                                                                       tions. In practice U(t) is capped to maintain tractable diver-\n     hj(x) = I sim(fθ(x), p+j ) > sim(fθ(x), p−j ) ,   (2)       sity.\n\n\n                                                 3\n\nFigure 1. An overview of the BiomedXPro evolutionary framework. At each iteration, a LLM generates new prompt pairs (P) guided by\na meta-prompt (Qt) containing a subset of previously successful candidates. The prompts are evaluated using BiomedCLIP to compute\na fitness score (sj). High-performing prompts are filtered to populate a buffer (U (t)) from which the next generation’s candidates are\nselected.  Finally, a crowding step is applied to the evolved population to yield a diverse, optimal set of prompts (P ∗) for explainable\ndiagnosis.\n\n\nLLM-guided mutation.  Unlike traditional evolutionary      to provide a clear optimization signal. To counteract re-\noperators, we employ an LLM to generate refined prompt     cency bias [20], these exemplars are sorted in ascending\nvariations. Given selected prompts and their performance     order of fitness. Based on findings from Yang et al. [20],\nfeedback, the LLM is instructed, via meta-prompt Qt, to     scores are normalized to an integer range [60-90] for sta-\ncreate Kt new prompt pairs that: (1) capture distinct medi-       bility. Finally, Chain-of-Thought prompting [19] is enabled\ncal concepts, (2) yield better performance.                      via ”Formulate a strategy” and ”Let’s think step-by-step” to\n  At each iteration, a subset of Ks prompt pairs is drawn       elicit reasoned generation.\nfrom the memory buffer U(t) for mutation using roulette\nwheel selection [6] guided by fitness scores.  This prob-                                                 Crowding for Diversity.  After all T generations have\nabilistic strategy balances exploration of diverse prompts                                                           completed, we apply a crowding mechanism inspired by\nwith a bias toward those of higher fitness. The structure                                                 NSGA-II [2] to the final candidate pool U(T ) to eliminate\nof Qt is shown below:                                      semantic redundancy. Candidate prompts are clustered by\n                                                          semantic similarity via an LLM guided by the meta-prompt\n    The task is to generate distinct                Qcrowd:\n    textual descriptions pairs <task\n    description>.  Here are the best                                                    The task is to group textual\n    performing pairs in ascending order.                                                    description pairs...\n    High scores indicate higher quality.                                                    <Numbered List of Kc prompt pairs>\n    Current Top <Ks> prompt pairs:                  Group the prompt pairs that has\n    <List of prompt pairs with                                                    exactly same observation but differ\n    normalized scores>                                                    only in language variations.  Give\n    Write <Kt> new prompt pairs that                the indexes of the grouped pairs\n    are different from the old ones and                                                    in the output.  Provide the output\n    have a score as high as possible.                                                    as follows:  list[list[index:int]].\n    Formulate a strategy.  Only provide                                                    Make sure to include all pairs in\n    the output as Python code...Let’s                                                    the output, even if they are not\n    think step-by-step                                                    grouped with others.  Let’s think\n                                                    step by step\n  The meta-prompt’s design is critical for effective genera-\ntion. While sampled via roulette wheel for diversity, the in-        This prompt instructs the LLM to act as a semantic de-\ncontext examples are framed as the ”top performing pairs”      duplicator, grouping prompts that describe the same core\n\n\n                                                 4\n\nAlgorithm 1: Evolutionary Prompt Optimization           4. Experiments and results\n  for Biomedical Classification                                                               4.1. Experimental setup\n   Input: Dataset D = {(xi, yi)}Ni=1, pre-trained\n          encoders fθ, gϕ, meta-prompts               We evaluate our proposed BiomedXPro framework on a\n        {Q0, Qt, Qcrowdt    }, threshold α, generations           diverse set of biomedical tasks, with a specific focus on\n         T, initial population size K0, sampling size              its ability to generate interpretable and high-performing\n        Ks, generation size Kt.                          prompts for few-shot learning and generalization. All ex-\n  Output: Optimized prompt set P ∗.                        periments were conducted using the same base models for a\n                                                        (0)                 fair comparison and were run on a single NVIDIA GeForce   Initialization: Generate initial population P   by                                        RTX 3090 Ti GPU.\n    prompting LLM with Q0.\n   for t = 1 to T do\n      foreach (p−j , p+j ) in P (t−1) do                      Base models.  For  the VLM, we employed Biomed-\n          Evaluate fitness sj using performance metric       CLIP [10] with a ViT-B/16 backbone, a model that has\n      M;                                            demonstrated  state-of-the-art zero-shot  classification on\n                                                              various biomedical benchmarks.  For the LLM, we em-      Update memory buffer U(t) with prompts\n                                                         ployed Gemma 3-27B-it [16], accessed via Google AI Stu-\n        satisfying sj ≥α;\n                                                             dio with default model parameters (temperature, top-k, top-\n       Selection: Sample Ks prompt pairs from U(t)                                                                        p).\n       using roulette-wheel selection guided by sj;\n      Mutation: Use LLM with meta-prompt Qt to\n        generate new prompt pairs P (t) emphasizing           Datasets.  We evaluate on three public benchmarks span-\n        diversity and higher performance;                     ning  diverse imaging  modalities:  Derm7pt  [8]  (der-\n                                                        moscopy), WBCAtt [17] (peripheral blood smears), and\n   Final Crowding: Remove redundant prompts from                                                Camelyon17-WILDS [9] (histopathology).  Camelyon17-\n   U(T ) to obtain P ∗;                                         WILDS enables domain generalization assessment, with\n   Prediction: Aggregate classifiers using weighted                                                                  hospitals serving as distinct domains, while Derm7pt and\n    majority voting.                                            WBCAtt are used to evaluate interpretability and clinical\n                                                                relevance. Meta-prompts used for each dataset is provided\n                                                                   in the supplementary material.\n\nobservation despite linguistic differences. Within each clus-\nter returned by the LLM, only the highest-scoring pair     Experimental protocols and evaluation.  We consider\nis retained. The resulting set of unique, high-performing      three evaluation protocols.  (i) Few-shot learning: varying\nprompts constitutes our final optimized prompt set, P ∗:         the number of labeled samples per class (Nc ∈1, 2, 4, 8, 16)\n                                                                   to assess data efficiency.  (ii) Clinical relevance: assessing\n           P ∗← [  argmax  s.               (6)     whether high-fitness prompts capture clinically validated\n                                                              concepts, using Derm7pt and WBCAtt. For Derm7pt, we                      c∈C (p−,p+,s)∈c\n                                                                           restrict to binary melanoma versus non-melanoma classifi-\n                                                                   cation, while WBCAtt is extended to a multiclass setting via\n                                                                one-vs-rest binary classifiers.  (iii) Domain generalization:\nFinal Prediction.  For the final prediction, the optimized      training on three hospital domains of Camelyon17-WILDS\nset of prompts P ∗⊆U(T ) is aggregated via weighted ma-     and evaluating on the unseen hospital domain.\njority voting:                                  We compare against zero-shot BiomedCLIP and repre-\n                                                                   sentative prompt-tuning approaches, including CoOp [24],\n                                            CoCoOp [23], and their biomedical extensions Biomed-            K∗           K∗  \n                             1\n                 ˆy = I X wjhj(x) >          X wj            (7)    CoOp [10] and XCoOp [1].  For all prompt-tuning base-                        2     ,                    lines, we adopt the default hyperparameters (e.g., learning                 j=1             j=1\n                                                                          rate, training epochs, number of LLM prompts) from the\n                                                                          official BiomedCoOp implementation to ensure a fair com-\nwhere each weight wj is set to the corresponding fitness      parison. Given the class imbalance inherent in biomedical\nscore sj over validation data, ensuring that more reliable      datasets, we use the F1-macro score as our primary evalua-\nprompts contribute more strongly to the final decision.                                                                   tion metric. Given the class imbalance inherent in biomed-\nThe complete BiomedXPro framework is summarized in      ical datasets, we use the F1-macro score as our primary\nAlgorithm 1.                                                   evaluation metric.\n\n\n                                                 5\n\nBiomedXPro parameters.  The evolutionary search  is        For the Derm7pt task, the analysis reveals a strong cor-\nrun for 500 generations (T = 500), initialized with a pop-      relation. The most statistically significant indicator, ‘Lin-\nulation of 50 prompt pairs (K0 = 50). In each generation,     ear Irregular’ vascular structures (P = 0.80), was cap-\nwe sample 10 candidates (Ks = 10) for mutation and in-     tured by a high-fitness prompt pair (F1: 0.6523) contrasting\nstruct the LLM to generate 10 new refinements (Kt = 10),     a ’regular, linear arrangement’ with a ’chaotic, branching\nwhile maintaining a memory buffer of up to 1000 pairs to      pattern.’ Other key features like the ‘Blue-Whitish Veil’\npreserve diversity. Fitness is evaluated using the inverse bi-     (P = 0.59) were also identified by high-scoring prompts\nnary cross-entropy for the 1- and 2-shot settings, and the     (F1: 0.6667) that distinguished its absence from when it\nF1-macro score for higher-shot regimes. The fitness thresh-       is ’present and associated with ulceration.’  Furthermore,\nold α is set relative to the zero-shot baseline, ensuring that      the prompts with the highest F1-scores (up to 0.6741) cor-\nprompts performing below chance for the chosen metric are     responded to another strong indicator, ‘Atypical Pigment\ndiscarded. Final crowding is performed over 3 iterations on    Network’ (P = 0.55), by providing nuanced descriptions\nbatches of 30 pairs. Results are averaged over three inde-     such as ’variegated pigmentation with shades of brown,\npendent runs.                                                    black, blue, and grey.’\n                                                                      Similarly, For Neutrophil classification on WBCAtt, the\n4.2. Results and analysis                                                      framework again captured the most predictive features. For\nQuantitative  performance.  BiomedXPro  consistently      instance, the presence of small granules (P = 1.00) was\noutperforms all baselines in the data-scarce few-shot regime      identified by a prompt contrasting ’clear and homogenous’\n(Table 1). Its advantage is most pronounced in the critical     cytoplasm with cytoplasm that ”contains fine, pale lilac\n1–8 shot range, demonstrating strong generalization across     granules,” while the highly predictive unsegmented-band\nthe diverse tasks and imaging modalities represented by the     nucleus (P = 0.85) was described by a prompt distinguish-\nbenchmarks.                                                 ing a ’predominantly spherical’ nucleus from one that is\n  A notable trend is the underperformance of Biomed-     ”irregular and lobulated.” This consistent alignment across\nCoOp, and XCoOp compared to standard CoOp and Co-      tasks demonstrates that the framework’s evolutionary pro-\nCoOp. We hypothesize that this stems from its reliance on     cess discovers and textually articulates statistically signifi-\na single static LLM-generated prompt to inject biomedical     cant visual features in an interpretable manner. The com-\nknowledge.  In our optimization framework, we observed      plete prompt ensembles (P ∗) discovered for both Derm7pt\nthat single-query LLM prompts often yield suboptimal so-     and WBCAtt are provided in the supplementary material.\nlutions, effectively constraining the search space and lead-\ning to weaker generalization. By contrast, BiomedXPro     4.3. Ablation studies\ncontinually explores and refines prompt candidates, avoid-\ning this limitation and converging toward a diverse ensem-\nble of high-fitness solutions\n\n\nFull-data regime.  To assess whether our method remains\ncompetitive in data-abundant settings, we evaluate on the\nfull Derm7pt  dataset.   Results are shown in Table  2.\nBiomedXPro remains comparable to the strongest base-\nline (XCoOp), while offering the added advantage of inter-\npretable prompts. This indicates that our framework does\nnot sacrifice performance even when abundant labeled data\nis available.                                                      Figure 2. Effect of prompt selection strategy on convergence. Our\n                                                               proposed Roulette Wheel selection achieves the best balance of\nClinical relevance.  To validate that BiomedXPro learns      exploration and exploitation, leading to more stable and consistent\n                                                               performance gains compared to Best-N and Random selection.clinically relevant concepts, we analyze the semantic align-\nment between the discovered prompts and the training\ndata’s statistical features.   Specifically, we compute the     Effect of prompt selection criteria.  We analyze the im-\nconditional probability P(class | observation) across the     pact of the strategy for sampling mutation candidates by\ntraining dataset to ground our analysis. The full conditional     comparing our proposed Roulette Wheel Selection against\nprobabilities are provided in the supplementary material.     two baselines: deterministic Best-N and uniform Random\nThe following analysis demonstrates a strong correspon-      selection. As shown in Fig. 2, these baselines represent ex-\ndence between these statistics and the semantic content of     tremes of the exploration-exploitation trade-off. Best-N se-\nthe discovered prompts.                                          lection focuses purely on exploitation, leading to premature\n\n\n                                                 6\n\nTable 1.  F1-macro percentage results of BiomedXPro compared with baseline methods across zero-shot and few-shot settings.\nCamelyon17-WILDS is evaluated in a domain generalization setup (train on 3 hospitals, test on unseen). Derm7pt is restricted to bi-\nnary melanoma vs. non-melanoma. WBCAtt is extended to multiclass classification via one-vs-rest classifiers.\n\n            Dataset           Method             1-Shot   2-Shot   4-Shot   8-Shot   16-Shot\n                                   Zero-shot                               41.93\n                         CoOp                 78.79    70.76    74.15    84.25    88.47\n          Camelyon17WILDS  CoCoOp              76.43    66.13    75.19    85.13    86.88\n                           BiomedCoOp          53.15    61.06    58.69    63.46    56.94\n                        XCoOp               66.90    35.60    45.00    64.20    84.50\n                             BiomedXPro(Ours)   72.06    86.95    90.20    90.87    90.38\n                                   Zero-shot                               27.86\n                         CoOp                 33.91    55.88    58.70    54.92    61.38\n           Derm7pt          CoCoOp              33.89    56.70    50.97    54.36    57.06\n                           BiomedCoOp          52.49    57.22    45.96    51.30    61.46\n                        XCoOp               39.50    58.70    60.10    41.90    54.80\n                             BiomedXPro(Ours)   64.54    61.45    60.87    58.51    64.17\n                                   Zero-shot                               10.50\n                         CoOp                 33.08    41.74    55.10    67.81     75.5\n          WBCAtt          CoCoOp              31.86    41.91    55.96    62.02    72.19\n                           BiomedCoOp          11.24    10.83    10.48    10.57    10.91\n                        XCoOp               26.20    22.10    22.80    25.20     28.9\n                             BiomedXPro(Ours)   41.39    47.31    58.33    69.63    72.18\n\n\n         Table 2. Full-data Derm7pt results (F1-macro).\n\n         Method            F1-macro\n          BiomedXPro (Ours)     71.14\n         BiomedCoOp           59.02\n         CoOp                  67.91\n        XCoOp                75.60\n         CoCoOp               67.68\n\n\nconvergence in local optima, while Random selection’s pure\n                                                                  Figure 3. Impact of generation size per iteration on performance.\nexploration provides an inefficient and erratic search signal\n                                                        The 10-pair setting (our choice) provides the optimal balance, out-\nto the LLM. Our approach effectively balances this trade-off\n                                                                performing 5 pairs and 50 pairs.\nby probabilistically favoring higher-fitness candidates while\nmaintaining sufficient randomness for exploration, resulting\nin the stable and consistent performance gains shown in the\n                                                          a favorable balance between refinement diversity and opti-learning curves.\n                                                           mization stability while being more cost-effective in terms\n                                                              of token usage.\nImpact of generation size per iteration.  We also ana-\nlyze the number of prompt pairs generated per mutation\nstep, comparing our choice of 10 against smaller (5) and\nlarger (50) sets. As shown in Fig. 3, generating only 5 pairs     Effect of chain-of-thought prompting.  We investigated\nleads to slow convergence, while a large set of 50 causes      the effect of Chain-of-Thought (CoT) prompting by adding\nperformance to plateau quickly after a strong start. While     an instruction for the LLM to first ”formulate a strategy”\nthe precise reason for this degradation with a large genera-     and ”Let’s think step-by-step” for improvement before gen-\ntion size is unclear, this finding is consistent with prior work      erating new candidates. As shown in Fig. 4, this addition\nby Yang et al. [20], who also observed that a moderate num-     leads to consistently better performance. Examples of CoT\nber of generated instructions was optimal. Based on these     generated by the LLM are provided in the supplementary\nfindings, we utilize a generation size of 10, as it provides      material.\n\n\n                                                 7\n\nases from the VLM’s pre-training data, potentially affect-\n                                                             ing fairness across diverse patient populations, an important\n                                                              area for further investigation.\n\n\n                                                           Architectural limitations and validation assumptions.\n                                                                   Architecturally, the proposed framework is formulated for\n                                                             binary classification. While effective in multiclass settings\n                                                                via a one-vs-rest scheme, this approach can lead to over-\n                                                                specialized negative prompts (p−j ) that describe a single\n                                                       competing class (e.g., contrasting ’Eosinophils’ with ’Neu-\nFigure 4.  Effect of Chain-of-Thought (CoT) prompting, which      trophils’) rather than a general negative case. Extending the\nconsistently outperforms a direct-instruction baseline.              framework to natively handle multiclass prompt sets (in-\n                                                               stead of a prompt pair) is a non-trivial future research di-\n                                                                 rection that must address the combinatorial complexity of\n                                                           updating the prompt set. Another architectural limitation is\n                                                                     that diversity is enforced via crowding only as a final post-\n                                                             processing step. We found that per-iteration LLM-driven\n                                                                  clustering was unstable, sometimes erroneously grouping\n                                                                 disparate prompts.  Future work could integrate diversity\n                                                         maintenance at each optimization step by using a more de-\n                                                                   terministic semantic similarity metric on the prompts or the\n                                                      prompt embeddings. Furthermore, our validation approach\n                                                                   in this work relies on training data statistics as a proxy for\nFigure 5. Effect of initial population size on performance. A larger      clinical importance, a measure that may itself be subject to\nand more diverse initial population (50) consistently outperforms      dataset-specific biases.\nsmaller sets\n\n                                                     Future work in clinical verification and grounding.   Fi-\n                                                                       nally, building full clinical trust requires deeper verification\nEffect of initial population size.  We compare initial sizes\n                                                              of the model’s reasoning. While our framework generates\nK0 of 10, 30, and 50, and find that a larger initial popula-\n                                                             highly descriptive prompts (e.g., ’variegated pigmentation\ntion of 50 consistently outperforms the smaller sets (Fig. 5).\n                                                          with shades of brown, black, blue, and grey’), future work\nThis suggests that a broader initial semantic space provides\n                                                                              is needed to verify that the VLM’s decision-making is truly\na more robust foundation for the optimization, preventing\n                                                                    sensitive to such nuanced details. A comprehensive vali-\npremature convergence on a narrow range of concepts. We\n                                                              dation would also require visual grounding analysis, using\ndid not explore sizes beyond 50 due to the practical limi-\n                                                      methods like Grad-CAM [15], to ensure the model’s spatial\ntations of our LLM, which struggled to reliably generate a\n                                                                   attention aligns with the features described in the prompts.\nlarge and exact number of distinct prompts in a single query.\n                                                     Both steps, coupled with rigorous evaluation by clinical do-\n4.4. Limitations and future work                     main experts, are essential for ensuring the model’s reason-\n                                                             ing process is robust and truly aligned with clinical prac-\nDependencies on pre-trained models and data.  The ef-       tice.\nficacy of BiomedXPro is fundamentally dependent on two\ncore components:  the underlying LLM and VLM. The     5. Conclusion\nframework’s ability to generate clinically relevant prompts\nis inherently capped by the breadth and accuracy of the     In this work, we introduce BiomedXPro, an evolution-\nbiomedical knowledge encoded within the LLM, creating     ary framework that generates diverse ensembles of inter-\na potential knowledge bottleneck.  While state-of-the-art      pretable, natural-language prompts for biomedical image\ncommercial models like GPT-4 (used by XCoOp [1] and      classification. Our method addresses the critical limitations\nBiomedCoOp [10]) contain extensive knowledge, their use     of uninterpretable soft prompts and single-prompt systems\nin an iterative framework with hundreds of generations is     by leveraging an LLM as both a biomedical knowledge ex-\nprohibitively expensive, necessitating a trade-off between      tractor and an adaptive optimizer within an evolutionary\nmodel capability and computational cost.  Similarly, the      search.\nframework’s performance is tied to the VLM’s ability to       Our experiments demonstrate that BiomedXPro consis-\nform a meaningful embedding space, and it may inherit bi-      tently outperforms state-of-the-art prompt-tuning methods\n\n\n                                                 8\n\nin challenging few-shot and domain generalization settings          in-the-Wild Distribution Shifts, 2021. arXiv:2012.07421 [cs].\nacross multiple biomedical datasets. Crucially, our analy-        5\nsis shows that the discovered prompts are not only high-      [10] Taha Koleilat, Hojat Asgariandehkordi, Hassan Rivaz, and\nperforming but are also semantically aligned with statis-        Yiming Xiao. BiomedCoOp: Learning to Prompt for Biomed-\ntically significant clinical features, grounding the model’s            ical Vision-Language Models, 2025. arXiv:2411.15232 [cs].\n                                                                                  1, 2, 3, 5, 8predictions in verifiable concepts. By directly addressing\n                                                                     [11] Shihong Liu, Samuel Yu, Zhiqiu Lin, Deepak Pathak, andthe fundamental needs for interpretability, diversity, and\n                                                           Deva Ramanan. Language Models as Black-Box Optimizers\ntrustworthiness, BiomedXPro represents a significant step\n                                                                               for Vision-Language Models. In 2024 IEEE/CVF Conference\ntoward the safe and reliable deployment of advanced vision-                                                             on Computer Vision and Pattern Recognition (CVPR), pages\nlanguage models in clinical practice.                                                                12687–12697, Seattle, WA, USA, 2024. IEEE. 2\n                                                                     [12] Chantal Pellegrini, Matthias Keicher, Ege ¨Ozsoy, Petra Ji-\nReferences                                                           raskova, Rickmer Braren, and Nassir Navab.   Xplainer:\n                                                        From X-Ray Observations to Explainable Zero-Shot Diagno-\n[1] Yequan Bie, Luyang Luo, Zhixuan Chen, and Hao Chen.             sis, 2023. arXiv:2303.13391 [cs]. 3\n    Xcoop: Explainable prompt learning for computer-aided di-                                                                     [13] Xiangyan Qu, Gaopeng Gou, Jiamin Zhuang, Jing Yu, Kun\n    agnosis via concept-guided context optimization.   In In-                                                                  Song, Qihao Wang, Yili Li, and Gang Xiong. ProAPO: Pro-\n    ternational Conference on Medical Image Computing and                                                                            gressively Automatic Prompt Optimization for Visual Classi-\n    Computer-Assisted Intervention, pages 773–783. Springer,                                                                                     fication, 2025. arXiv:2502.19844 [cs]. 3\n    2024. 1, 2, 3, 5, 8                                                                     [14] Alec Radford, Jong Wook Kim,  Chris Hallacy, Aditya\n[2] Kalyanmoy Deb, Amrit Pratap, Sameer Agarwal, and T. Me-         Ramesh,  Gabriel Goh,  Sandhini Agarwal,  Girish  Sastry,\n    yarivan. A fast and elitist multiobjective genetic algorithm:       Amanda  Askell, Pamela Mishkin,  Jack Clark,  Gretchen\n    Nsga-ii. IEEE Transactions on Evolutionary Computation, 6          Krueger, and Ilya Sutskever.   Learning Transferable Vi-\n    (2):182–197, 2002. 4                                                  sual Models From Natural Language Supervision,  2021.\n[3] Yingjun Du, Wenfang Sun, and Cees G M Snoek. IPO: Inter-         arXiv:2103.00020 [cs]. 1, 2\n    pretable Prompt Optimization for Vision-Language Models.      [15] Ramprasaath R. Selvaraju, Michael Cogswell, Abhishek\n     1, 2                                                             Das, Ramakrishna Vedantam, Devi Parikh, and Dhruv Ba-\n[4] Sedigheh Eslami, Christoph Meinel, and Gerard de Melo.             tra. Grad-CAM: Visual Explanations from Deep Networks via\n   PubMedCLIP: How Much Does CLIP Benefit Visual Ques-          Gradient-based Localization. International Journal of Com-\n    tion Answering in the Medical Domain? In Findings of the As-          puter Vision, 128(2):336–359, 2020. arXiv:1610.02391 [cs].\n    sociation for Computational Linguistics: EACL 2023, pages        8\n    1181–1193, Dubrovnik, Croatia, 2023. Association for Com-      [16] Gemma Team, Aishwarya Kamath, Johan Ferret, Shreya\n    putational Linguistics. 2                                             Pathak, Nino Vieillard, Ramona Merhej, Sarah Perrin, Ta-\n[5] Chrisantha Fernando, Dylan Banarse, Henryk Michalewski,           tiana Matejovicova, Alexandre Ram´e, Morgane Rivi`ere, Louis\n   Simon Osindero, and Tim Rockt¨aschel. Promptbreeder: Self-           Rouillard, Thomas Mesnard, Geoffrey Cideron, Jean bastien\n    Referential Self-Improvement Via Prompt Evolution, 2023.            Grill, Sabela Ramos, Edouard Yvinec, Michelle Casbon, Eti-\n    arXiv:2309.16797 [cs]. 2                                        enne Pot, Ivo Penchev, Ga¨el Liu, Francesco Visin, Kathleen\n                                                                      Kenealy, Lucas Beyer, Xiaohai Zhai, Anton Tsitsulin, Robert\n[6] David E. Goldberg. Genetic algorithms in search, optimiza-\n                                                                      Busa-Fekete, Alex Feng, Noveen Sachdeva, Benjamin Cole-\n     tion, and machine learning. In Addison-Wesley Longman Pub-\n                                                              man, Yi Gao, Basil Mustafa, Iain Barr, Emilio Parisotto,\n    lishing Co., Inc. 1989. 4\n                                                               David Tian, Matan Eyal, Colin Cherry, Jan-Thorsten Pe-\n[7] Qingyan Guo, Rui Wang, Junliang Guo, Bei Li, Kaitao Song,                                                                                                 ter, Danila Sinopalnikov, Surya Bhupatiraju, Rishabh Agar-\n   Xu Tan, Guoqing Liu, Jiang Bian, and Yujiu Yang.  Evo-                                                                         wal, Mehran Kazemi, Dan Malkin, Ravin Kumar, David Vi-\n    Prompt:  Connecting LLMs with Evolutionary Algorithms                                                                                                 lar, Idan Brusilovsky, Jiaming Luo, Andreas Steiner, Abe\n    Yields Powerful Prompt Optimizers, 2025. arXiv:2309.08532                                                                             Friesen, Abhanshu Sharma, Abheesht Sharma, Adi Mayrav\n     [cs]. 2                                                                          Gilady, Adrian Goedeckemeyer, Alaa Saade, Alex Feng,\n[8] Jeremy Kawahara, Sara Daneshvar, Giuseppe Argenziano,         Alexander Kolesnikov, Alexei Bendebury, Alvin Abdagic,\n    and Ghassan Hamarneh. Seven-Point Checklist and Skin Le-        Amit Vadi, Andr´as Gy¨orgy, Andr´e Susano Pinto, Anil Das,\n    sion Classification Using Multitask Multimodal Neural Nets.        Ankur Bapna, Antoine Miech, Antoine Yang, Antonia Pa-\n   IEEE Journal of Biomedical and Health Informatics, 23(2):           terson, Ashish Shenoy, Ayan Chakrabarti,  Bilal Piot, Bo\n    538–546, 2019. 5                                        Wu, Bobak Shahriari, Bryce Petrini, Charlie Chen, Char-\n[9] Pang  Wei  Koh,   Shiori  Sagawa,   Henrik  Marklund,           line Le Lan, Christopher A. Choquette-Choo, CJ Carey, Cor-\n   Sang Michael Xie, Marvin Zhang, Akshay Balsubramani,        mac Brick, Daniel Deutsch, Danielle Eisenbud, Dee Cat-\n   Weihua Hu, Michihiro Yasunaga, Richard Lanas Phillips,              tle, Derek Cheng, Dimitris Paparas, Divyashree Shivaku-\n    Irena Gao, Tony Lee, Etienne David, Ian Stavness, Wei        mar Sreepathihalli, Doug Reid, Dustin Tran, Dustin Zelle,\n   Guo, Berton A. Earnshaw, Imran S. Haque, Sara Beery, Jure          Eric Noland, Erwin Huizenga, Eugene Kharitonov, Freder-\n    Leskovec, Anshul Kundaje, Emma Pierson, Sergey Levine,          ick Liu, Gagik Amirkhanyan, Glenn Cameron, Hadi Hashemi,\n    Chelsea Finn, and Percy Liang. WILDS: A Benchmark of        Hanna Klimczak-Pluci´nska, Harman Singh, Harsh Mehta,\n\n\n                                                 9\n\nHarshal Tushar Lehri, Hussein Hazimeh, Ian Ballantyne,      [23] Kaiyang Zhou, Jingkang Yang, Chen Change Loy, and Zi-\n    Idan Szpektor,  Ivan Nardini,  Jean Pouget-Abadie,  Jetha         wei Liu. Conditional Prompt Learning for Vision-Language\n    Chan, Joe Stanton, John Wieting, Jonathan Lai, Jordi Or-         Models. In 2022 IEEE/CVF Conference on Computer Vision\n    bay, Joseph Fernandez, Josh Newlan, Ju yeong Ji, Jyotin-        and Pattern Recognition (CVPR), pages 16795–16804, New\n    der Singh, Kat Black, Kathy Yu, Kevin Hui, Kiran Vo-          Orleans, LA, USA, 2022. IEEE. 5\n     drahalli, Klaus Greff, Linhai Qiu, Marcella Valentine, Ma-      [24] Kaiyang Zhou, Jingkang Yang, Chen Change Loy, and Zi-\n    rina Coelho, Marvin Ritter, Matt Hoffman, Matthew Wat-         wei Liu.  Learning to Prompt for Vision-Language Models.\n    son, Mayank Chaturvedi, Michael Moynihan, Min Ma, Nabila          International Journal of Computer Vision, 130(9):2337–2348,\n    Babar, Natasha Noy, Nathan Byrd, Nick Roy, Nikola Mom-         2022. 1, 2, 5\n    chev, Nilay Chauhan, Noveen Sachdeva, Oskar Bunyan,      [25] Yongchao Zhou, Andrei Ioan Muresanu, Ziwen Han, Keiran\n    Pankil Botarda, Paul Caron, Paul Kishan Rubenstein, Phil           Paster, Silviu Pitis, Harris Chan, and Jimmy Ba. Large Lan-\n    Culliton, Philipp Schmid, Pier Giuseppe Sessa, Pingmei Xu,         guage Models Are Human-Level Prompt Engineers, 2023.\n    Piotr Stanczyk, Pouya Tafti, Rakesh Shivanna, Renjie Wu,         arXiv:2211.01910 [cs]. 2\n   Renke Pan, Reza Rokni, Rob Willoughby, Rohith Vallu, Ryan\n    Mullins, Sammy Jerome, Sara Smoot, Sertan Girgin, Shariq\n    Iqbal, Shashir Reddy, Shruti Sheth, Siim P˜oder, Sijal Bhat-\n    nagar, Sindhu Raghuram Panyam, Sivan Eiger, Susan Zhang,\n    Tianqi Liu, Trevor Yacovone, Tyler Liechty, Uday Kalra, Utku\n    Evci, Vedant Misra, Vincent Roseberry, Vlad Feinberg, Vlad\n    Kolesnikov, Woohyun Han, Woosuk Kwon, Xi Chen, Yin-\n   lam Chow, Yuvein Zhu, Zichuan Wei, Zoltan Egyed, Victor\n    Cotruta, Minh Giang, Phoebe Kirk, Anand Rao, Kat Black,\n    Nabila Babar, Jessica Lo, Erica Moreira, Luiz Gustavo Mar-\n     tins, Omar Sanseviero, Lucas Gonzalez, Zach Gleicher, Tris\n    Warkentin, Vahab Mirrokni, Evan Senter, Eli Collins, Joelle\n    Barral, Zoubin Ghahramani, Raia Hadsell, Yossi Matias, D.\n    Sculley, Slav Petrov, Noah Fiedel, Noam Shazeer, Oriol\n    Vinyals, Jeff Dean, Demis Hassabis, Koray Kavukcuoglu,\n    Clement Farabet, Elena Buchatskaya, Jean-Baptiste Alayrac,\n   Rohan Anil, Dmitry, Lepikhin, Sebastian Borgeaud, Olivier\n   Bachem, Armand Joulin, Alek Andreev, Cassidy Hardin,\n    Robert Dadashi, and L´eonard Hussenot. Gemma 3 technical\n     report, 2025. 5\n[17] Satoshi Tsutsui, Winnie Pang, and Bihan Wen. WBCAtt: A\n    White Blood Cell Dataset Annotated with Detailed Morpho-\n    logical Attributes, 2023. arXiv:2306.13531 [cs]. 5\n[18] Zifeng Wang, Zhenbang Wu, Dinesh Agarwal, and Jimeng\n    Sun. MedCLIP: Contrastive Learning from Unpaired Medical\n    Images and Text, 2022. arXiv:2210.10163 [cs]. 2\n[19] Jason Wei,  Xuezhi Wang,  Dale Schuurmans,  Maarten\n   Bosma, Brian Ichter, Fei Xia, Ed Chi, Quoc Le, and Denny\n    Zhou.   Chain-of-Thought Prompting Elicits Reasoning in\n    Large Language Models, 2023. arXiv:2201.11903 [cs]. 4\n[20] Chengrun Yang, Xuezhi Wang, Yifeng Lu, and Hanxiao Liu.\n   LARGE LANGUAGE MODELS AS OPTIMIZERS. 2, 4, 7\n[21] Sheng Zhang, Yanbo Xu, Naoto Usuyama, Hanwen Xu,\n    Jaspreet Bagga, Robert Tinn, Sam Preston, Rajesh Rao, Mu\n    Wei, Naveen Valluri, Cliff Wong, Andrea Tupini, Yu Wang,\n    Matt Mazzola, Swadheen Shukla, Lars Liden, Jianfeng Gao,\n    Angela Crabtree, Brian Piening, Carlo Bifulco, Matthew P.\n    Lungren, Tristan Naumann, Sheng Wang, and Hoifung Poon.\n   BiomedCLIP: a multimodal biomedical foundation model\n    pretrained from fifteen million scientific image-text pairs,\n    2025. arXiv:2303.00915 [cs]. 1, 2\n[22] Zihao Zhao, Yuxiao Liu, Han Wu, Mei Wang, Yonghao Li,\n   Sheng Wang, Lin Teng, Disheng Liu, Zhiming Cui, Qian\n   Wang, and Dinggang Shen.  CLIP in Medical Imaging: A\n    Comprehensive Survey, 2024. arXiv:2312.07353 [cs]. 2\n\n\n                                                 10\n\nSupplementary material\n\nMeta-Prompts utilized for each dataset\n\nThis section presents the exact meta-prompts used for each dataset evaluated in this work.\n\nDerm7pt [8] (Melanoma vs Non-melanoma binary classification)\n\n• Q0 — Initial meta-prompt\n\n                                      Listing 1. Initial meta-prompt for the Derm7pt dataset (Q0).\n\n\n   Give 50 distinct textual descriptions of pairs of visual discriminative features to\n   identify whether a dermoscopic image of a skin lesion shows melanoma or not.\n   These are the following features an expert would look for: Pigment Network, Blue\n   Whitish Veil, Vascular Structures, Pigmentation, Streaks, Dots and Globules, Regression\n    Structures.\n   Each description pair must contain two contrasting features: one indicative of benign,\n   and one indicative of a melanoma\n\n   Only provide the output as Python code in the following format:\n   prompts = list[tuple[negative: str, positive: str]]\n   Let’s think step-by-step\n\n\n• Qt — Mutation meta-prompt\n\n                                     Listing 2. Mutation meta-prompt for the Derm7pt dataset (Qt).\n\n\n   The task is to generate distinct textual descriptions pairs of visual discriminative\n   features to identify whether a dermoscopic image of a skin lesion shows melanoma or not\n   .\n   These are the following features an expert would look for: Pigment Network, Blue\n   Whitish Veil, Vascular Structures, Pigmentation, Streaks, Dots and Globules, Regression\n    Structures.\n   Each description pair must contain two contrasting features: one indicative of benign,\n   and one indicative of a melanoma\n\n   Here are the best performing pairs in ascending order. High scores indicate higher\n   quality visual discriminative features.\n   Current top 10 prompt pairs:\n   1. (\"....\", \"....\"), Score: 60\n   2. ..\n   ...\n\n   Write 10 new prompt pairs that are different from the old ones and has a score as high\n   as possible, formulate a strategy.\n   Only provide the output as Python code in the following format: prompts = list[tuple[\n   negative: str, positive: str]]. Let’s think step-by-step\n\n\n• Qcrowd — Crowding meta-prompt\n\n                                   Listing 3. Crowding meta-prompt for the Derm7pt dataset (Qcrowd).\n\n\n   The task is to group textual description pairs of visual discriminative features for\n   melanoma detection in a skin lesion.\n   Current Prompt Pairs: Format: <Index. Prompt Pair>\n   1. (\"....\", \"....\")\n\n\n                                                 11\n\n2. ..\n   3. ..\n   ...\n   30. ...\n\n   Each pair corresponds to a feature of the same medical concept. Group the prompt pairs\n   that has exactly same observation but differ only in language variations. Give the\n   indexes of the grouped pairs in the output.\n   Provide the output as follows: list[list[index:int]]. Make sure to include all pairs in\n    the output, even if they are not grouped with others.\n   Let’s think step by step.\n\n\n\nWBCAtt [17] (Peripheral Blood Smears: Multiclass Cell-type classification)\n\nThe following meta-prompts were utilized for the WBCAtt dataset, which focuses on multiclass cell-type classification in pe-\nripheral blood smears. For each one-vs-rest binary classifier, the variables {BINARY LABEL} and {other labels str}\nare replaced with the specific cell-type being evaluated. The prompt leverages a set of defining attributes for each white blood\ncell type, which are stored in the MEDICAL CONCEPTS MAPPING dictionary. These attributes are:\n• Basophil: Nucleus=Segmented, NC Ratio=Low, Granularity=Yes, Color=Blue/Black (dense)\n• Eosinophil: Nucleus=Segmented, NC Ratio=Low, Granularity=Yes, Color=Red\n• Lymphocyte: Nucleus=Unsegmented, NC Ratio=High, Granularity=No, Size=Small\n• Monocyte: Nucleus=Unsegmented, NC Ratio=Low, Granularity=No\n• Neutrophil: Nucleus=Segmented, NC Ratio=Low, Granularity=Yes, Color=Blue\n\n\n• Q0 — Initial meta-prompt\n\n                                      Listing 4. Initial meta-prompt for the WBCAtt dataset (Q0).\n\n\n   Give 50 distinct textual descriptions of pairs of visual discriminative features to\n   identify whether the peripheral blood cell is a {BINARY_LABEL} or not. Other cell types\n    include {other_labels_str}.\n   These are the following features an expert would look for: Cell Size, Cell Shape,\n   Nucleus Shape, Nuclear-Cytoplasmic Ratio, Chromatin-Density, Cytoplasm-Vacuole,\n   Cytoplasm-Texture, Cytoplasm-Color, Granule-Type, Granule-Color, Granularity\n   {MEDICAL_CONCEPTS_MAPPING[BINARY_LABEL]}\n\n   Only provide the output as Python code in the following format: prompts = list[tuple[\n   negative: str, positive: str]]. Let’s think step-by-step\n\n\n• Qt — Mutation meta-prompt\n\n                                     Listing 5. Mutation meta-prompt for the WBCAtt dataset (Qt).\n\n\n   The task is to generate distinct textual descriptions of pairs of visual discriminative\n    features to identify whether the peripheral blood cell is a {BINARY_LABEL} or not.\n   Other cell types include {other_labels_str}.\n   These are the following features an expert would look for: Cell Size, Cell Shape,\n   Nucleus Shape, Nuclear-Cytoplasmic Ratio, Chromatin-Density, Cytoplasm-Vacuole,\n   Cytoplasm-Texture, Cytoplasm-Color, Granule-Type, Granule-Color, Granularity\n   {MEDICAL_CONCEPTS_MAPPING[BINARY_LABEL]}\n\n   Here are the best performing pairs in ascending order. High scores indicate higher\n   quality visual discriminative features.\n\n\n                                                 12\n\nCurrent top 10 prompt pairs:\n   1. (\"....\", \"....\"), Score: 60\n   2. ..\n   ...\n\n   Write 10 new prompt pairs that are different to from the old ones and has a score as\n   high as possible. Formulate a strategy\",\n   Only provide the output as Python code in the following format: prompts = list[tuple[\n   negative: str, positive: str]]. Let’s think step-by-step\n\n\n• Qcrowd — Crowding meta-prompt\n\n                                   Listing 6. Crowding meta-prompt for the WBCAtt dataset (Qcrowd).\n\n\n   The task is to group textual description pairs of visual discriminative features for\n   white blood cell classification.\n   Current Prompt Pairs: Format: <Index. Prompt Pair>\n   1. (\"....\", \"....\")\n   2. ..\n   3. ..\n   ...\n   30. ...\n\n   Each pair corresponds to a feature of the same medical concept. Group the prompt pairs\n   that has exactly same observation but differ only in language variations. Give the\n   indexes of the grouped pairs in the output.\n   Provide the output as follows: list[list[index:int]]. Make sure to include all pairs in\n    the output, even if they are not grouped with others.\n   Let’s think step by step.\n\n\n\nCamelyon17-WILDS [9](Histopathology: Binary Classification)\n\n• Q0 — Initial meta-prompt\n\n                                Listing 7. Initial meta-prompt for the Camelyon17-WILDS dataset (Q0).\n\n\n   Give 50 distinct textual descriptions of pairs of visual discriminative features to\n   identify whether the central region of a histopathological image patch contains tumor\n   tissue or not. The patch is extracted from an H&E-stained whole-slide image of a lymph\n   node section. Only provide the output as Python code in the following format: prompts =\n    list[tuple[negative: str, positive: str]]\n\n\n• Qt — Mutation meta-prompt\n\n                               Listing 8. Mutation meta-prompt for the Camelyon17-WILDS dataset (Qt).\n\n\n   The task is to generate distinct textual descriptions pairs of visual discriminative\n   features to identify whether the central region of a histopathological image patch\n   contains tumor tissue or not. The patch is extracted from an H&E-stained whole-slide\n   image of a lymph node section.\n   Here are the best performing pairs in ascending order. High scores indicate higher\n   quality visual discriminative features.\n\n   Current top 10 prompt pairs:\n\n\n                                                 13\n\n1. (\"....\", \"....\"), Score: 60\n   2. ..\n   ...\n\n   Write 10 new prompt pairs that are different to from the old ones and has a score as\n   high as possible.\n   Only provide the output as Python code in the following format: prompts = list[tuple[\n   negative: str, positive: str]]. Let’s think step-by-step\n\n\n• Qcrowd — Crowding meta-prompt\n\n                             Listing 9. Crowding meta-prompt for the Camelyon17-WILDS dataset (Qcrowd).\n\n   The task is to group textual description pairs of visual discriminative features for\n   tumor detection in histopathology.\n   Current Prompt Pairs: Format: <Index. Prompt Pair>\n   1. (\"....\", \"....\")\n   2. ..\n   3. ..\n   ...\n   30. ...\n   Each pair corresponds to a feature of the same medical concept. Group the prompt pairs\n   that has exactly same observation but differ only in language variations. Give the\n   indexes of the grouped pairs in the output.\n   Provide the output as follows: list[list[index:int]]. Make sure to include all pairs in\n    the output, even if they are not grouped with others. Let’s think step by step\n\n\n\nSample LLM CoT Strategy\n\nThis section presents sample Chain-of-Thought (CoT) responses generated by the Gemma 3-27b-it LLM, demonstrating its\nreasoning process for our meta-prompts. Listing 10 and Listing 11 show two distinct examples of the strategy formulated\nby the LLM in response to the optimization meta-prompt (Qt) for the Camelyon17-WILDS dataset. An example of the\nreasoning and final output for the crowding meta-prompt (Qcrowd) is provided in Listing 12.\n\n                 Listing 10. Example of LLM’s reasoning for the strategy as a response for the optimization meta prompt\n\n  Strategy to Enhance Prompt Fitness:\n  1. Highlight histopathological features that unambiguously separate benign/reactive from\n   tumor tissue.\n  2. Use precise, quantifiable terms based on standard diagnostic criteria.\n  3. Introduce new descriptors-nuclear size & contour, chromatin texture, necrosis,\n  apoptosis, cell cohesion, architectural disruption, cytoplasmic granularity, and\n  hallmark patterns (e.g., starry sky, rosettes).\n  4. Craft negative prompts around the absence or benign manifestation of these features,\n  and positive prompts around their abnormal or tumor-associated presentations.\n  5. Avoid repeating any feature pairs from the existing top-10 list.\n\n\n\n                 Listing 11. Example of LLM’s reasoning for the strategy as a response for the optimization meta prompt\n\n  Okay, let’s break down a strategy to generate high-scoring prompt pairs for identifying\n  tumor tissue in histopathological images.\n  1. Analyze Existing High-Scoring Pairs:\n  Specificity: The best pairs aren’t just \"normal\" vs. \"abnormal.\" They pinpoint specific\n  features. \"Abnormal cytoplasmic staining\" is better than just \"abnormal cells.\"\n  Visual Discriminability: The features must be readily observable in an H&E stain. Things\n   like molecular markers are out of scope.\n\n\n                                                 14\n\nTumor-Related Features: The features directly relate to hallmarks of cancer - abnormal\ngrowth, nuclear changes, necrosis, invasion, etc.\nContrast: The negative and positive prompts are clearly contrasting. \"No mitotic figures\n\" vs. \"Frequent mitotic figures\" is strong.\nLymph Node Context: Since the images are from lymph nodes, features related to lymph\nnode architecture (lymphatic invasion, reactive follicles) are relevant.\n2. Brainstorming Feature Categories:\nBased on the above, let’s consider categories of features to focus on:\nNuclear Features: Size, shape, chromatin, nucleoli, membrane irregularities. These are\nvery important in cancer diagnosis.\nCytoplasmic Features: Staining intensity, granularity, presence of inclusions.\nGrowth Patterns: How cells are arranged (sheets, clusters, single cells, palisading).\nMicroenvironment: Inflammation, fibrosis, vascular changes, necrosis.\nInvasion: Evidence of tumor cells breaking through boundaries (capsule, vessels,\nlymphatics).\nDifferentiation: Features suggesting the cell type or degree of differentiation (e.g.,\nplasmacytoid differentiation).\n3. Generating Prompt Pairs:\nI’ll aim for pairs that are:\nSpecific and visually discriminable.\nContrasting.\nRelevant to lymph node pathology.\nDifferent from the existing top 10.\n\n\n\n                 Listing 12. Example of the LLM’s reasoning and output in response to the crowding meta-prompt.\n\nLet’s think step by step. I will analyze the prompt pairs and group them based on\nidentical observations with language variations.\n\n* Group 1: No plasma cells identified/observed/present\n    * 3: (’No plasma cells are identified.’ , ’Numerous plasma cells with eccentric\nnuclei and abundant cytoplasm.’)\n    * 12: (’No plasma cells are identified.’ , ’Numerous plasma cells with eccentric\nnuclei are present.’)\n    * 14: (’No plasma cells are observed.’ , ’Increased number of plasma cells, some\nwith Dutcher bodies.’)\n    * 17: (’No plasma cells are identified.’ , ’Increased number of plasma cells, some\nwith Dutcher bodies.’)\n    * 18: (’No plasma cells are present.’ , ’Increased number of plasma cells with\neccentric nuclei.’)\n    * 22: (’No plasma cells are observed.’ , ’Abundant plasma cells with eccentric\nnuclei.’)\n    * 24: (’No plasma cells are identified.’ , ’Abundant plasma cells with eccentric\nnuclei are present.’)\n\n* Group 2: Few reactive lymphocytes vs. Numerous reactive lymphocytes\n    * 4: (’Few scattered reactive lymphocytes.’ , ’Sheets of atypical lymphocytes with\nbrisk proliferation.’)\n    * 6: (’Few reactive lymphocytes are present.’ , ’Dense infiltrate of atypical\nlymphocytes and plasma cells.’)\n    * 8: (’Few reactive lymphocytes are present.’ , ’Numerous reactive lymphocytes and\nplasma cells are observed.’)\n    * 13: (’Few reactive lymphocytes present.’ , ’Numerous reactive lymphocytes with\nplasmacytoid differentiation.’)\n    * 25: (’Few reactive lymphocytes are present.’ , ’Numerous reactive lymphocytes are\npresent, forming rosettes around tumor cells.’)\n    * 27: (’Few reactive lymphocytes.’ , ’Abundant reactive lymphocytes and atypical\nlymphoid cells.’)\n\n\n                                               15\n\n* 30: (’Few reactive lymphocytes present.’ , ’Numerous reactive lymphocytes forming\nrosettes around tumor cells.’)\n\n* Group 3: Lymphocyte maturity\n    * 9: (’Mature lymphocytes.’ , ’Immunoblasts and plasmablasts.’)\n    * 20: (’Lymphocytes are small and mature-appearing.’ , ’Lymphocytes are large and\nimmature-appearing with prominent nucleoli.’)\n    * 29: (’Lymphocytes are small and mature.’ , ’Lymphocytes are large and immature\nwith prominent nucleoli.’)\n\n* Group 4: Stroma cellularity\n    * 11: (’Stroma is edematous with minimal cellularity.’ , ’Stroma is densely cellular\n with a myxoid appearance.’)\n    * 28: (’Stroma is hypocellular with minimal collagen.’ , ’Stroma is hypercellular\nwith abundant collagen deposition.’)\n\n* Group 5: Atypical plasma cells\n    * 19: (’No atypical plasma cells are identified.’ , ’Presence of atypical plasma\ncells with prominent nucleoli.’)\n\n* Group 6: Inflammatory infiltrate\n    * 15: (’Inflammatory infiltrate is minimal and lymphocytic.’ , ’Dense inflammatory\ninfiltrate with neutrophils and eosinophils.’)\n    * 21: (’Minimal inflammatory infiltrate.’ , ’Dense inflammatory infiltrate with\nnumerous plasma cells.’)\n\n* Group 7: Eosinophils\n    * 16: (’No eosinophils are present.’ , ’Increased number of eosinophils infiltrating\n the tumor.’)\n\n* Group 8: Emperipolesis\n    * 10: (’No emperipolesis is observed.’ , ’Frequent emperipolesis is seen within\ntumor cells.’)\n\n* Group 9: Germinal Centers\n    * 26: (’Few reactive germinal centers.’ , ’Numerous large and atypical germinal\ncenters with prominent nucleoli.’)\n\n* Group 10: Infiltration of atypical cells\n    * 1: (’No infiltration of atypical cells.’ , ’Infiltration of atypical cells\ndisrupting normal lymph node architecture.’)\n    * 5: (’No infiltration of atypical cells into surrounding tissues.’ , ’Infiltration\nof atypical cells into surrounding tissues, disrupting normal structures.’)\n\n* Group 11: Cell Arrangement\n    * 2: (’Cells arranged in a normal lymphatic pattern.’ , ’Cells arranged in sheets or\n solid nests.’)\n\n* Group 12: Background Lymphoid Aggregates\n    * 23: (’Background shows normal lymphoid aggregates.’ , ’Background shows diffuse\nsheets of atypical cells.’)\n\n* Group 13: Immunocytes\n    * 7: (’Immunocytes are rare.’ , ’Abundant immunocytes are present, forming rosettes\n.’)\n\n--- Final Output ---\n[\n\n\n\n                                               16\n\n[3, 12, 14, 17, 18, 22, 24],\n    [4, 6, 8, 13, 25, 27, 30],\n    [9, 20, 29],\n    [11, 28],\n    [19],\n    [15, 21],\n    [16],\n    [10],\n    [26],\n    [1, 5],\n    [2],\n    [23],\n    [7]\n]\n\n\n\n\n\n                                               17\n\nPrompts Learnt\n\nThis section presents the final prompt ensembles (P ∗) generated by BiomedXPro. We provide the prompts learned in two\ndistinct experimental settings: the full-shot scenario, where the F1-macro score was used as the fitness metric, and the 1-shot\nscenario, where fitness was evaluated using the inverted Binary Cross-Entropy (BCE).\n\nDerm7pt\n\nThe prompts learnt for the 1-shot and full-shot scenarios are listed in Tab. 3 and Tab. 4 respectively.\n\n                   Table 3. Prompts Learned for the Derm7pt full dataset: F1-macro utilized as the fitness function\n\n Absence or Normal Appearance (p−j )            Disease-Indicative Observations (p+j )             Fitness Score (sj)\n Pigmentation is limited to brown tones with sharp   Pigmentation is variegated with shades of brown,        0.6741\n  borders.                                            black, blue, and grey, with ill-defined borders.\n Pigmentation is homogenous and limited to the   Pigmentation is heterogeneous and extends into        0.6724\n  epidermis.                                          the dermis, causing a bluish hue.\n Blue-whitish veil is absent.                        Blue-whitish veil is present and associated with        0.6667\n                                                        ulceration.\n Pigmentation is limited to the periphery with a   Pigmentation extends to the center of the lesion        0.6565\n normal skin color center.                         with shades of black, grey, and blue.\n Dots and globules have a smooth, rounded appear-   Dots and globules are angular, irregular, and ex-        0.6543\n  ance.                                                    hibit pseudopods.\n Pigmentation is light brown or tan.                Pigmentation is dark brown or black.                   0.6535\n Vascular structures show a regular, linear arrange-   Vascular structures display a chaotic, branching        0.6523\n ment following skin creases.                        pattern with irregular vessel diameters.\n Vascular structures are primarily hairpin-shaped   Vascular structures show branching vessels with        0.6506\n  telangiectasias.                                       irregular caliber and occasional hemorrhages.\n Pigmentation is predominantly brown with subtle   Pigmentation includes shades of black, grey, and        0.6419\n  variations.                                           blue, with abrupt color changes.\n Vascular structures are primarily small, regularly   Vascular structures demonstrate large, dilated ves-        0.6392\n spaced capillaries.                                     sels and hemorrhages.\n The lesion exhibits a smooth, symmetrical surface  The lesion exhibits an irregular, asymmetrical sur-         0.635\n with no evidence of ulceration or scarring.          face with ulceration, crusting, and surrounding in-\n                                                  flammation.\n Regression structures are absent or minimal, with   Regression  structures  are  significant,  with  a        0.6324\n  slight lightening of the skin.                         scarred, fibrotic appearance and possible ulcera-\n                                                            tion.\n The lesion exhibits a smooth, even surface texture.  The lesion demonstrates surface elevation, ulcera-        0.6322\n                                                            tion, or a nodular appearance.\n  Streaks  are  fine and follow  the  natural  skin   Streaks are thick, irregular, and abruptly change        0.6304\n  creases.                                               direction, suggesting rapid growth.\n\n\nWBCAtt\n\nThe prompts learned for the Neutrophil class in the full-shot and 1-shot scenarios are shown in Tab. 5 and Tab. 6, respectively.\n\nCamelyon17-WILDS\n\nThe prompts learned in both the 1-shot and 16-shot scenarios are shown in Tab. 7 and Tab. 8, respectively.\n\n\n\n\n\n                                                 18\n\nTable 4. Prompts Learned for the 1-Shot Derm7pt Case: Inverted BCE is utilized for the fitness function\n\nAbsence or Normal Appearance (p−j )            Disease-Indicative Observations (p+j )             Fitness Score (sj)\nBlue whitish veil is absent or minimal.            Blue whitish veil is pronounced and covers a sig-          1.0\n                                                        nificant portion of the lesion.\nBlue whitish veil is absent or very subtle.          Blue whitish veil is prominent and widespread,          1.0\n                                                obscuring the underlying structures.\nDots are evenly distributed and small.             Dots are clustered and large, with irregular shapes.          1.0\nDots and globules are small, round, and uniformly   Dots and globules are large, irregular, and exhibit          1.0\npigmented.                                        color variation.\nBlue-whitish veil is absent or minimal, with no   Blue-whitish veil is dense and associated with sur-          1.0\nassociated changes.                             rounding inflammation.\n\n\n\n\n\n            Table 5. Prompts Learned for Neutrophil Classification (Full-Shot Scenario): F1-macro as Fitness Function\n\nNegative Class Observation (p−j )                 Neutrophil-Indicative Observation (p+j )          Fitness Score (sj)\nThe cell shape is consistently round with a smooth  The cell shape is often irregular and slightly dis-        0.7945\nperimeter.                                            torted due to the segmented nucleus.\nCytoplasm is clear and homogenous, lacking dis-   Cytoplasm is abundant and contains fine, pale        0.7710\ntinct features.                                              lilac granules.\nThe nuclear shape is predominantly spherical with  The nuclear shape is irregular and lobulated, with        0.7565\na smooth outline.                                a clearly indented outline.\nGranules, if present, are sparse and difficult to dis-   Granules are abundant, easily visible, and fill a        0.7487\ncern.                                                   significant portion of the cytoplasm.\nThe cell shape is generally round or slightly irreg-  The cell exhibits a more polymorphic shape, often        0.7467\nular.                                              displaying pseudopods or extensions.\nThe cell shape is consistently oval or spherical,  The cell shape is highly variable and often irregu-        0.7418\nmaintaining a regular form.                                lar, exhibiting pseudopod extensions.\nThe cell shape is generally spherical or slightly  The cell exhibits an elongated or flattened shape.         0.7358\nirregular.\nGranules, if present, are small and indistinct.       Granules are large, prominent, and easily identifi-        0.7340\n                                                       able.\nThe cell size is similar to that of a small lympho-  The cell size is significantly larger, comparable to        0.7242\ncyte.                                           a monocyte.\nThe cell displays a uniform, homogenous cyto-  The cell displays a granular cytoplasm with a        0.7213\nplasm without any noticeable texture.                slightly textured appearance.\nGranules,  if present, are sparse and appear as   Granules are numerous, prominent, and exhibit a        0.7147\nsmall, indistinct dots.                                   distinct, segmented appearance.\nThe cell exhibits a uniform, smooth cytoplasmic  The cell exhibits an irregular cytoplasmic border        0.7133\nborder.                                         with occasional projections.\nThe cell exhibits a high nuclear-cytoplasmic ratio,  The cell displays a balanced nuclear-cytoplasmic        0.7109\nwith the nucleus occupying most of the cell vol-    ratio, with a substantial amount of cytoplasm.\nume.\nGranules, if present, are very few and evenly dis-   Granules are numerous and clustered in specific        0.7062\ntributed.                                           areas of the cytoplasm.\n\n\n\n\n\n                                               19\n\nTable 6. Prompts Learned for Neutrophil Classification (1-Shot Scenario): Inverted BCE as Fitness Function\n\nNegative Class Observation (p−j )                 Neutrophil-Indicative Observation (p+j )          Fitness Score (sj)\nBasophils granules contain histamine and heparin,   Neutrophils  granules  contain  enzymes   like        1.0000\ngiving them a metachromatic staining property.     myeloperoxidase and lysozyme, staining specifi-\n                                                      cally with neutral dyes.\nLymphocytes have a condensed, hyperchromatic   Neutrophils have a segmented nucleus with vary-        1.0000\nnucleus.                                          ing degrees of chromatin condensation in each\n                                                      lobe.\nBasophils often have a U- or S-shaped nucleus due   Neutrophils maintain a consistently segmented        1.0000\nto the abundance of granules.                      nuclear shape, even with granule presence.\nEosinophils have granules that are rich in major   Neutrophils have granules containing elastase and        1.0000\nbasic protein and eosinophil cationic protein.        collagenase.\nBasophils have granules that stain intensely with   Neutrophils have granules that stain weakly with        1.0000\nbasic dyes.                                      both acidic and basic dyes.\nBasophils exhibit a high nuclear-cytoplasmic ra-   Neutrophils have a low nuclear-cytoplasmic ratio,        0.9942\ntio, with a relatively small amount of cytoplasm.    with a significant amount of cytoplasm.\nLymphocytes have a consistently round nucleus.    Neutrophils have a segmented nucleus, typically        0.9515\n                                                with 3-5 lobes.\nMonocytes often present with a folded or irregular   Neutrophils consistently display a segmented nu-        0.5331\nnuclear shape.                                     cleus with distinct lobes.\nBasophils have intensely staining, dark purple   Neutrophils have granules that are less intensely        0.2721\ngranules that often fill the cytoplasm.               stained and more evenly distributed within the cy-\n                                                 toplasm.\nEosinophils typically have a bilobed nucleus, al-   Neutrophils are characterized by a multi-lobed nu-        0.2497\nthough variations exist.                               cleus, usually with 3-5 lobes.\nCells with a large, round nucleus and minimal cy-   Neutrophils are identified by their segmented nu-        0.2492\ntoplasm are often lymphocytes.                     cleus and relatively large amount of cytoplasm.\nEosinophilic   cytoplasm    is   indicative   of  The cytoplasm is pale blue or slightly pink.             0.2332\neosinophils.\nMonocytes typically exhibit a bean-shaped or   Neutrophils are defined by a multi-lobed, seg-        0.2013\nkidney-shaped nucleus.                        mented nucleus.\n\n\n\n\n\n                                               20\n\nTable 7. Prompts Learned for Camelyon17-WILDS (1-Shot Scenario): Inverted BCE as Fitness Function\n\nAbsence or Normal Appearance (p−j )            Disease-Indicative Observations (p+j )             Fitness Score (sj)\nCells arranged in a normal lymphatic pattern.       Cells arranged in sheets or solid nests.                  0.9998\nNo infiltration of atypical cells.                        Infiltration of atypical  cells disrupting normal        0.9998\n                                         lymph node architecture.\nNo plasma cells are identified.                 Numerous plasma cells with eccentric nuclei and        0.9994\n                                              abundant cytoplasm.\nFew scattered reactive lymphocytes.               Sheets of atypical lymphocytes with brisk prolif-        0.9992\n                                                        eration.\nImmunocytes are rare.                         Abundant immunocytes  are  present,  forming        0.9988\n                                                         rosettes.\nMature lymphocytes.                           Immunoblasts and plasmablasts.                       0.9987\nNo emperipolesis is observed.                    Frequent emperipolesis is seen within tumor cells.        0.9986\nStroma is edematous with minimal cellularity.      Stroma is densely cellular with a myxoid appear-        0.9984\n                                                   ance.\nNo eosinophils are present.                        Increased number of eosinophils infiltrating the        0.9980\n                                                 tumor.\nInflammatory infiltrate is minimal and lympho-  Dense inflammatory  infiltrate with neutrophils        0.9980\ncytic.                                       and eosinophils.\nNo atypical plasma cells are identified.             Presence of atypical plasma cells with prominent        0.9979\n                                                       nucleoli.\nBackground shows normal lymphoid aggregates.   Background shows diffuse sheets of atypical cells.        0.9973\nFew reactive germinal centers.                 Numerous large and atypical germinal centers        0.9971\n                                                with prominent nucleoli.\nLymphocytes show low proliferative activity.      Lymphocytes  exhibit  brisk  proliferation  with        0.9966\n                                      many dividing cells.\nNormal vasculature with thin walls.               Thickened and  irregular  vasculature  with  in-        0.9962\n                                                 creased blood flow.\nLow nuclear-to-cytoplasmic ratio in lymphocytes.  High nuclear-to-cytoplasmic ratio in tumor cells.         0.9953\nGerminal centers are small and inactive.           Germinal centers are large and hyperactive with        0.9947\n                                           numerous mitotic figures.\nMinimal inflammatory infiltrate.                Dense inflammatory infiltrate with lymphocytes        0.9946\n                                            and plasma cells.\nAdipose tissue is present in normal distribution.    Adipose tissue is compressed or replaced by tu-        0.9946\n                                               mor.\nClear cytoplasm in lymphocytes.                 Darkly stained, irregular cytoplasm in tumor cells.        0.9941\nLymphocytes are small and uniform.            Tumor cells are large and pleomorphic.                 0.9941\nNo mitoses observed.                            Frequent mitoses with atypical mitotic figures.           0.9940\nStroma is collagenous and hypocellular.           Stroma is fibrotic and hypercellular with increased        0.9938\n                                                    mitotic activity.\nFew plasma cells are seen.                    Numerous plasma cells with atypical morphology.        0.9937\n\n\n\n\n\n                                               21\n\nTable 8. Prompts Learned for Camelyon17-WILDS (16-Shot Scenario): F1-macro as Fitness Function\n\nAbsence or Normal Appearance (p−j )            Disease-Indicative Observations (p+j )             Fitness Score (sj)\nNo increase in mitotic activity.                     Increased mitotic activity.                             0.9193\nNo increase in eosinophilic cytoplasm.             Increased eosinophilic cytoplasm in tumor cells.         0.8982\nNormal follicular architecture is preserved.         Disrupted follicular architecture with loss of po-        0.8904\n                                                                larity.\nLymphocytes are small and round with dense nu-   Lymphocytes are large and atypical with promi-        0.8859\nclei.                                             nent nucleoli.\nBenign inflammatory infiltrate.                    Aggressive, atypical inflammatory infiltrate.             0.8837\nNo prominent nucleolus.                        Large and prominent nucleoli within tumor cells.        0.8822\nNo increase in nuclear size.                    Marked increase in nuclear size (nuclear pleomor-        0.8806\n                                                 phism).\nNo atypical cells present.                         Presence of atypical cells with pleomorphic nu-        0.8763\n                                                              clei.\nNo fibrosis.                                       Increased  stromal  fibrosis  surrounding  tumor        0.8748\n                                                        nests.\nNo increase in interfollicular proliferation.          Increased interfollicular proliferation of atypical        0.8663\n                                                             cells.\nNo high-grade nuclear features.                   Presence of high-grade nuclear features.                0.8627\nCells exhibit normal size and shape.                Cells  exhibit  significant  variation  in  size and        0.8532\n                                              shape (anisocytosis and pleomorphism).\nNo increased number of macrophages.             Increased number of macrophages infiltrating the        0.8490\n                                                          tissue.\nStroma with minimal collagen deposition.         Desmoplastic stroma with abundant collagen de-        0.8476\n                                                       position.\nNo spindle cell morphology.                     Predominantly spindle cell morphology.                0.8298\nNo perivascular lymphocytic cuffing.               Perivascular lymphocytic cuffing around tumor        0.8297\n                                                        nests.\nNo increased nuclear-to-cytoplasmic ratio.          Increased nuclear-to-cytoplasmic ratio in tumor        0.8278\n                                                             cells.\nNo syncytial formation.                            Syncytial formation of tumor cells.                     0.8233\nNo evidence of extracellular mucin.               Presence of extracellular mucin surrounding tu-        0.8225\n                                       mor cells.\n\n\n\n\n\n                                               22\n\nClinical Relevance Analysis\n\nTo provide a deeper, evidence-based validation of the prompts’ clinical relevance, we ground our analysis in the statistical\nfeatures of the training data. To create a quantitative measure of importance for the visual features in a dataset, we compute\nthe conditional probability P(class | observation). This is calculated by dividing the number of images of a given class that\nexhibit a specific observation by the total number of images where that observation is present, across the training set. This\nprobability serves as a data-driven proxy for the diagnostic significance of a visual feature.\n\n Table 9. Conditional probabilities of melanoma given specific clinical observations, calculated on the Derm7pt training dataset (N=412).\n\n                             Clinical Observation               P(Melanoma | Obs.)\n                            Vascular Structures: Linear Irregular             0.80\n                           Blue-Whitish Veil: Present                      0.59\n                           Regression Structures: Combinations            0.58\n                         Pigment Network: Atypical                     0.55\n                              Streaks: Irregular                              0.53\n                            Pigmentation: Diffuse Irregular                 0.48\n                            Vascular Structures: Dotted                     0.48\n                          Dots and Globules: Irregular                    0.47\n                           Regression Structures: White Areas              0.42\n                            Pigmentation: Localized Irregular               0.33\n                           Regression Structures: Blue Areas               0.33\n\n\nDerm7pt Analysis\n\nFor the Derm7pt dataset, we calculated these probabilities for key dermatoscopic features associated with melanoma. The\nresults are presented in Tab. 9. A detailed comparison between these statistical findings and the learned full-shot prompts\n(presented in Tab. 3) reveals a strong and consistent alignment:\n• Vascular Structures: The most predictive feature, ‘Linear Irregular’ vascular structures (P = 0.80), was captured by the\n  high-fitness prompt pair (F1: 0.6523) that contrasts a ’regular, linear arrangement following skin creases’ with a ’chaotic,\n  branching pattern with irregular vessel diameters.’\n• Blue-Whitish Veil: The second most significant feature, the presence of a ‘Blue-Whitish Veil’ (P = 0.59), was identified\n  by a high-scoring prompt (F1: 0.6667) distinguishing its absence from when it is ’present and associated with ulceration.’\n• Regression Structures & Streaks: Other key indicators like regression structures (P = 0.58) and irregular streaks\n  (P = 0.53) were also identified, with prompts learning to contrast ’absent or minimal’ structures with ’significant, with a\n  scarred, fibrotic appearance,’ and ’fine, natural’ streaks with those that are ’thick, irregular, and abruptly change direction.’\n• Pigment Network: Notably, while ‘Atypical Pigment Network’ was a strong statistical indicator (P = 0.55), prompts\n  describing nuanced aspects of pigmentation consistently achieved the highest F1-scores (up to 0.6741), such as the top-\n  performing pair contrasting ’limited to brown tones with sharp borders’ with being ’variegated with shades of brown, black,\n  blue, and grey.’\n\nWBCAtt Analysis\n\nA similar analysis was performed for the WBCAtt dataset, focusing on the one-vs-rest classification of Neutrophils. We\ncalculated the conditional probabilities for key cytological observations, presented in Tab. 10. The following is a detailed\ncomparison between these statistics and the prompts learned in the full-shot scenario (presented in Tab. 5).\n• Granules: The statistical data identifies the presence of ‘Small’ and ‘Pink’ granules as perfect predictors (P = 1.00).\n  This is directly captured by the second-highest scoring prompt (F1: 0.7710), which contrasts a ’clear and homogenous’\n  cytoplasm with one that is ’abundant and contains fine, pale lilac granules.’ Multiple other high-fitness prompts also focus\n  on the abundance and visibility of granules.\n• Nucleus Shape: The ‘Unsegmented-band’ nucleus shape is a highly significant statistical feature (P = 0.85). The frame-\n  work learned this concept, generating a high-fitness prompt (F1: 0.7565) that distinguishes a ’predominantly spherical’\n  nucleus from one that is ’irregular and lobulated, with a clearly indented outline.’\n• Complex Feature Learning: Interestingly, while ‘Irregular’ cell shape is a weak statistical predictor on its own (P =\n  0.32), the highest-scoring learned prompt (F1: 0.7945) is about cell shape. It learns a more complex, conditional feature\n\n\n                                                 23\n\nby contrasting a ’consistently round’ shape with one that is ’often irregular and slightly distorted due to the segmented\n  nucleus.’ This shows the framework’s ability to discover nuanced, multi-part features that are more discriminative than the\n  simple statistical correlations.\n   This alignment demonstrates that BiomedXPro effectively identifies and articulates the key cytological features necessary\nfor cell type classification.\n\nTable 10. Conditional probabilities of a cell being a Neutrophil given specific cytological observations, calculated on the WBCAtt training\ndataset.\n\n                           Cytological Observation              P(Neutrophil | Obs.)\n                          Granule Type: Small                           1.00\n                          Granule Colour: Pink                           1.00\n                          Nucleus Shape: Unsegmented-band              0.85\n                              Granularity: Yes                               0.43\n                         Cytoplasm Colour: Light blue                   0.43\n                         Cytoplasm Texture: Clear                       0.40\n                           Nuclear-Cytoplasmic Ratio: Low                0.37\n                             Cell Size: Big                                 0.36\n                         Chromatin Density: Densely                    0.35\n                          Nucleus Shape: Segmented-multilobed           0.34\n                         Cytoplasm Vacuole: No                        0.34\n                             Cell Shape: Round                             0.32\n                             Cell Shape: Irregular                           0.32\n                             Cell Size: Small                               0.28\n                          Nucleus Shape: Segmented-bilobed              0.20\n                         Cytoplasm Vacuole: Yes                        0.15\n\n\nLimitation on Multiclass Classification\n\nAs mentioned in the main paper, while the one-vs-rest scheme is effective for extending our binary framework to multiclass\nproblems, it can lead to the generation of over-specialized negative prompts (p−j ). Instead of learning a general description\nfor a ”non-target” class, the evolutionary process often discovers that the most effective strategy is to describe a single, high-\ncontrast competing class. The prompts learned for the Eosinophil class in the WBCAtt full-shot scenario provide a clear\nexample of this behavior.\n  A review of the highest-scoring prompts (presented in Tab. 11) shows that the negative prompts are not general descriptions\nof blood cells, but are instead specific definitions of other cell types:\n• The top-performing prompt (F1: 0.8311) uses a description of a Neutrophil for its negative case: ’Neutrophils exhibit\n  granules that stain neutrally, appearing a faint lilac color.’\n• The second-highest scoring prompt (F1: 0.8247) uses a Monocyte as the negative exemplar: ’Monocytes exhibit a dull,\n  greyish cytoplasm.’\n• The third-highest scoring prompt (F1: 0.8179) uses a Basophil: ’Basophils have granules that stain metachromatically,\n  appearing purple-black.’\n   This analysis shows that the framework effectively converts the one-vs-rest problem into a series of highly discriminative\none-vs-one classifiers. While this is a powerful strategy for achieving high performance, it creates classifiers that may be\nbrittle and less generalizable to the full spectrum of other classes. This finding further motivates the future work discussed in\nthe main paper: extending the framework to natively handle a multiclass prompt set.\n\n\n\n\n\n                                                 24\n\nTable 11. Prompts Learned for Eosinophil Classification (Full-Shot Scenario)\n\nNegative Class Observation (p−j )                 Eosinophil-Indicative Observation (p+j )          Fitness Score (sj)\nNeutrophils exhibit granules that stain neutrally,   Eosinophil granules are intensely stained with        0.8311\nappearing a faint lilac color.                         eosin, resulting in a bright red-orange color.\nMonocytes exhibit a dull, greyish cytoplasm.       Eosinophils display a cytoplasm with a pale pink        0.8247\n                                                   or slightly orange hue.\nBasophils have granules that stain metachromati-   Eosinophil granules stain specifically with eosin,        0.8179\ncally, appearing purple-black.                        resulting in a bright orange-red color.\nBasophils display dark blue or purple granules   Eosinophil granules are characteristically bright        0.8092\nthat often overwhelm the cytoplasm.               pink  or  red-orange,  contrasting with  the  ba-\n                                                     sophilic granules of basophils.\nMonocytes display a folded or indented nuclear   Eosinophil nuclei are generally round or oval with        0.8079\nmembrane.                                     a smooth, regular membrane.\nMonocytes  exhibit a  ”cloud-like”  or ”ground   Eosinophil cytoplasm is filled with distinct, re-        0.8015\nglass” appearance to their cytoplasm.                  fractile granules, lacking the diffuse appearance\n                                                   of monocytes.\nThe cytoplasm of a lymphocyte is usually scant   Eosinophil cytoplasm is plentiful and filled with        0.7971\nand clear.                                             characteristic red-orange granules.\n\n\n\n\n\n                                               25",
"headers": [
"arXiv:2510.15866v1  [cs.CV]  17 Oct 2025",
"BiomedXPro: Prompt Optimization for Explainable Diagnosis with Biomedical",
"Vision Language Models",
"Sanduni Ubayasiri",
"University of Peradeniya",
"Peradeniya, Sri Lanka",
"Mansitha Eashwara",
"Kaushitha Silva",
"Ruwan Tennakoon",
"RMIT University",
"Melbourne, Australia",
"Damayanthi Herath",
"Abstract",
"1. Introduction",
"2. Related work",
"3. Methodology",
"4. Experiments and results",
"5. Conclusion",
"References",
"Supplementary material",
"Meta-Prompts utilized for each dataset",
"Sample LLM CoT Strategy",
"Prompts Learnt",
"Clinical Relevance Analysis"
],
"tables": [
"|Col1|BiomedXPro(Ours)|72.06|86.95|90.20|90.87|90.38|\n|---|---|---|---|---|---|---|",
"|Col1|BiomedXPro(Ours)|64.54|61.45|60.87|58.51|64.17|\n|---|---|---|---|---|---|---|",
"|Col1|BiomedXPro(Ours)|41.39|47.31|58.33|69.63|72.18|\n|---|---|---|---|---|---|---|",
"|Absence or Normal Appearance (p− )<br>j|Disease-Indicative Observations (p+ )<br>j|Fitness Score (s )<br>j|\n|---|---|---|\n|<br>Pigmentation is limited to brown tones with sharp<br>borders.|<br>Pigmentation is variegated with shades of brown,<br>black, blue, andgrey, with ill-defined borders.|0.6741|\n|Pigmentation is homogenous and limited to the<br>epidermis.|Pigmentation is heterogeneous and extends into<br>the dermis, causing a bluish hue.|0.6724|\n|Blue-whitish veil is absent.|Blue-whitish veil is present and associated with<br>ulceration.|0.6667|\n|Pigmentation is limited to the periphery with a<br>normal skin color center.|Pigmentation extends to the center of the lesion<br>with shades of black, grey, and blue.|0.6565|\n|Dots and globules have a smooth, rounded appear-<br>ance.|Dots and globules are angular, irregular, and ex-<br>hibitpseudopods.|0.6543|\n|Pigmentation is light brown or tan.|Pigmentation is dark brown or black.|0.6535|\n|Vascular structures show a regular, linear arrange-<br>ment following skin creases.|Vascular structures display a chaotic, branching<br>pattern with irregular vessel diameters.|0.6523|\n|Vascular structures are primarily hairpin-shaped<br>telangiectasias.|Vascular structures show branching vessels with<br>irregular caliber and occasional hemorrhages.|0.6506|\n|Pigmentation is predominantly brown with subtle<br>variations.|Pigmentation includes shades of black, grey, and<br>blue, with abrupt color changes.|0.6419|\n|Vascular structures are primarily small, regularly<br>spaced capillaries.|Vascular structures demonstrate large, dilated ves-<br>sels and hemorrhages.|0.6392|\n|The lesion exhibits a smooth, symmetrical surface<br>with no evidence of ulceration or scarring.|The lesion exhibits an irregular, asymmetrical sur-<br>face with ulceration, crusting, and surrounding in-<br>flammation.|0.635|\n|Regression structures are absent or minimal, with<br>slight lightening of the skin.|Regression structures are significant,<br>with a<br>scarred, fibrotic appearance and possible ulcera-<br>tion.|0.6324|\n|The lesion exhibits a smooth, even surface texture.|The lesion demonstrates surface elevation, ulcera-<br>tion, or a nodular appearance.|0.6322|\n|Streaks are fine and follow the natural skin<br>creases.|Streaks are thick, irregular, and abruptly change<br>direction, suggesting rapidgrowth.|0.6304|",
"|Absence or Normal Appearance (p− )<br>j|Disease-Indicative Observations (p+ )<br>j|Fitness Score (s )<br>j|\n|---|---|---|\n|<br>Blue whitish veil is absent or minimal.|<br>Blue whitish veil is pronounced and covers a sig-<br>nificantportion of the lesion.|1.0|\n|Blue whitish veil is absent or very subtle.|Blue whitish veil is prominent and widespread,<br>obscuring the underlying structures.|1.0|\n|Dots are evenly distributed and small.|Dots are clustered and large, with irregular shapes.|1.0|\n|Dots and globules are small, round, and uniformly<br>pigmented.|Dots and globules are large, irregular, and exhibit<br>color variation.|1.0|\n|Blue-whitish veil is absent or minimal, with no<br>associated changes.|Blue-whitish veil is dense and associated with sur-<br>rounding inflammation.|1.0|",
"|Negative Class Observation (p− )<br>j|Neutrophil-Indicative Observation (p+ )<br>j|Fitness Score (s )<br>j|\n|---|---|---|\n|<br>The cell shape is consistently round with a smooth<br>perimeter.|<br>The cell shape is often irregular and slightly dis-<br>torted due to the segmented nucleus.|0.7945|\n|Cytoplasm is clear and homogenous, lacking dis-<br>tinct features.|Cytoplasm is abundant and contains fine, pale<br>lilacgranules.|0.7710|\n|The nuclear shape is predominantly spherical with<br>a smooth outline.|The nuclear shape is irregular and lobulated, with<br>a clearly indented outline.|0.7565|\n|Granules, if present, are sparse and difficult to dis-<br>cern.|Granules are abundant, easily visible, and fill a<br>significantportion of the cytoplasm.|0.7487|\n|The cell shape is generally round or slightly irreg-<br>ular.|The cell exhibits a more polymorphic shape, often<br>displaying pseudopods or extensions.|0.7467|\n|The cell shape is consistently oval or spherical,<br>maintaining a regular form.|The cell shape is highly variable and often irregu-<br>lar, exhibiting pseudopod extensions.|0.7418|\n|The cell shape is generally spherical or slightly<br>irregular.|The cell exhibits an elongated or flattened shape.|0.7358|\n|Granules, if present, are small and indistinct.|Granules are large, prominent, and easily identifi-<br>able.|0.7340|\n|The cell size is similar to that of a small lympho-<br>cyte.|The cell size is significantly larger, comparable to<br>a monocyte.|0.7242|\n|The cell displays a uniform, homogenous cyto-<br>plasm without any noticeable texture.|The cell displays a granular cytoplasm with a<br>slightly textured appearance.|0.7213|\n|Granules, if present, are sparse and appear as<br>small, indistinct dots.|Granules are numerous, prominent, and exhibit a<br>distinct, segmented appearance.|0.7147|\n|The cell exhibits a uniform, smooth cytoplasmic<br>border.|The cell exhibits an irregular cytoplasmic border<br>with occasionalprojections.|0.7133|\n|The cell exhibits a high nuclear-cytoplasmic ratio,<br>with the nucleus occupying most of the cell vol-<br>ume.|The cell displays a balanced nuclear-cytoplasmic<br>ratio, with a substantial amount of cytoplasm.|0.7109|\n|Granules, if present, are very few and evenly dis-<br>tributed.|Granules are numerous and clustered in specific<br>areas of the cytoplasm.|0.7062|",
"|Negative Class Observation (p− )<br>j|Neutrophil-Indicative Observation (p+ )<br>j|Fitness Score (s )<br>j|\n|---|---|---|\n|<br>Basophils granules contain histamine and heparin,<br>giving them a metachromatic staining property.|<br>Neutrophils<br>granules<br>contain<br>enzymes<br>like<br>myeloperoxidase and lysozyme, staining specifi-<br>cally with neutral dyes.|1.0000|\n|Lymphocytes have a condensed, hyperchromatic<br>nucleus.|Neutrophils have a segmented nucleus with vary-<br>ing degrees of chromatin condensation in each<br>lobe.|1.0000|\n|Basophils often have a U- or S-shaped nucleus due<br>to the abundance ofgranules.|Neutrophils maintain a consistently segmented<br>nuclear shape, even withgranulepresence.|1.0000|\n|Eosinophils have granules that are rich in major<br>basicprotein and eosinophil cationicprotein.|Neutrophils have granules containing elastase and<br>collagenase.|1.0000|\n|Basophils have granules that stain intensely with<br>basic dyes.|Neutrophils have granules that stain weakly with<br>both acidic and basic dyes.|1.0000|\n|Basophils exhibit a high nuclear-cytoplasmic ra-<br>tio, with a relatively small amount of cytoplasm.|Neutrophils have a low nuclear-cytoplasmic ratio,<br>with a significant amount of cytoplasm.|0.9942|\n|Lymphocytes have a consistently round nucleus.|Neutrophils have a segmented nucleus, typically<br>with 3-5 lobes.|0.9515|\n|Monocytes often present with a folded or irregular<br>nuclear shape.|Neutrophils consistently display a segmented nu-<br>cleus with distinct lobes.|0.5331|\n|Basophils have intensely staining, dark purple<br>granules that often fill the cytoplasm.|Neutrophils have granules that are less intensely<br>stained and more evenly distributed within the cy-<br>toplasm.|0.2721|\n|Eosinophils typically have a bilobed nucleus, al-<br>though variations exist.|Neutrophils are characterized by a multi-lobed nu-<br>cleus, usually with 3-5 lobes.|0.2497|\n|Cells with a large, round nucleus and minimal cy-<br>toplasm are often lymphocytes.|Neutrophils are identified by their segmented nu-<br>cleus and relatively large amount of cytoplasm.|0.2492|\n|Eosinophilic<br>cytoplasm<br>is<br>indicative<br>of<br>eosinophils.|The cytoplasm is pale blue or slightly pink.|0.2332|\n|Monocytes typically exhibit a bean-shaped or<br>kidney-shaped nucleus.|Neutrophils are defined by a multi-lobed, seg-<br>mented nucleus.|0.2013|",
"|Absence or Normal Appearance (p− )<br>j|Disease-Indicative Observations (p+ )<br>j|Fitness Score (s )<br>j|\n|---|---|---|\n|<br>Cells arranged in a normal lymphaticpattern.|<br>Cells arranged in sheets or solid nests.|0.9998|\n|No infiltration of atypical cells.|Infiltration of atypical cells disrupting normal<br>lymph node architecture.|0.9998|\n|No plasma cells are identified.|Numerous plasma cells with eccentric nuclei and<br>abundant cytoplasm.|0.9994|\n|Few scattered reactive lymphocytes.|Sheets of atypical lymphocytes with brisk prolif-<br>eration.|0.9992|\n|Immunocytes are rare.|Abundant immunocytes are present,<br>forming<br>rosettes.|0.9988|\n|Mature lymphocytes.|Immunoblasts andplasmablasts.|0.9987|\n|No emperipolesis is observed.|Frequent emperipolesis is seen within tumor cells.|0.9986|\n|Stroma is edematous with minimal cellularity.|Stroma is densely cellular with a myxoid appear-<br>ance.|0.9984|\n|No eosinophils are present.|Increased number of eosinophils infiltrating the<br>tumor.|0.9980|\n|Inflammatory infiltrate is minimal and lympho-<br>cytic.|Dense inflammatory infiltrate with neutrophils<br>and eosinophils.|0.9980|\n|No atypical plasma cells are identified.|Presence of atypical plasma cells with prominent<br>nucleoli.|0.9979|\n|Background shows normal lymphoid aggregates.|Background shows diffuse sheets of atypical cells.|0.9973|\n|Few reactive germinal centers.|Numerous large and atypical germinal centers<br>withprominent nucleoli.|0.9971|\n|Lymphocytes show low proliferative activity.|Lymphocytes exhibit brisk proliferation with<br>many dividing cells.|0.9966|\n|Normal vasculature with thin walls.|Thickened and irregular vasculature with in-<br>creased blood flow.|0.9962|\n|Low nuclear-to-cytoplasmic ratio in lymphocytes.|High nuclear-to-cytoplasmic ratio in tumor cells.|0.9953|\n|Germinal centers are small and inactive.|Germinal centers are large and hyperactive with<br>numerous mitotic figures.|0.9947|\n|Minimal inflammatory infiltrate.|Dense inflammatory infiltrate with lymphocytes<br>andplasma cells.|0.9946|\n|Adipose tissue is present in normal distribution.|Adipose tissue is compressed or replaced by tu-<br>mor.|0.9946|\n|Clear cytoplasm in lymphocytes.|Darkly stained, irregular cytoplasm in tumor cells.|0.9941|\n|Lymphocytes are small and uniform.|Tumor cells are large andpleomorphic.|0.9941|\n|No mitoses observed.|Frequent mitoses with atypical mitotic figures.|0.9940|\n|Stroma is collagenous and hypocellular.|Stroma is fibrotic and hypercellular with increased<br>mitotic activity.|0.9938|\n|Fewplasma cells are seen.|Numerousplasma cells with atypical morphology.|0.9937|",
"|Absence or Normal Appearance (p− )<br>j|Disease-Indicative Observations (p+ )<br>j|Fitness Score (s )<br>j|\n|---|---|---|\n|<br>No increase in mitotic activity.|<br>Increased mitotic activity.|0.9193|\n|No increase in eosinophilic cytoplasm.|Increased eosinophilic cytoplasm in tumor cells.|0.8982|\n|Normal follicular architecture is preserved.|Disrupted follicular architecture with loss of po-<br>larity.|0.8904|\n|Lymphocytes are small and round with dense nu-<br>clei.|Lymphocytes are large and atypical with promi-<br>nent nucleoli.|0.8859|\n|Benign inflammatory infiltrate.|Aggressive, atypical inflammatory infiltrate.|0.8837|\n|Noprominent nucleolus.|Large andprominent nucleoli within tumor cells.|0.8822|\n|No increase in nuclear size.|Marked increase in nuclear size (nuclear pleomor-<br>phism).|0.8806|\n|No atypical cells present.|Presence of atypical cells with pleomorphic nu-<br>clei.|0.8763|\n|No fibrosis.|Increased stromal fibrosis surrounding tumor<br>nests.|0.8748|\n|No increase in interfollicular proliferation.|Increased interfollicular proliferation of atypical<br>cells.|0.8663|\n|No high-grade nuclear features.|Presence of high-grade nuclear features.|0.8627|\n|Cells exhibit normal size and shape.|Cells exhibit significant variation in size and<br>shape (anisocytosis andpleomorphism).|0.8532|\n|No increased number of macrophages.|Increased number of macrophages infiltrating the<br>tissue.|0.8490|\n|Stroma with minimal collagen deposition.|Desmoplastic stroma with abundant collagen de-<br>position.|0.8476|\n|No spindle cell morphology.|Predominantly spindle cell morphology.|0.8298|\n|No perivascular lymphocytic cuffing.|Perivascular lymphocytic cuffing around tumor<br>nests.|0.8297|\n|No increased nuclear-to-cytoplasmic ratio.|Increased nuclear-to-cytoplasmic ratio in tumor<br>cells.|0.8278|\n|No syncytial formation.|Syncytial formation of tumor cells.|0.8233|\n|No evidence of extracellular mucin.|Presence of extracellular mucin surrounding tu-<br>mor cells.|0.8225|",
"|Negative Class Observation (p− )<br>j|Eosinophil-Indicative Observation (p+ )<br>j|Fitness Score (s )<br>j|\n|---|---|---|\n|<br>Neutrophils exhibit granules that stain neutrally,<br>appearing a faint lilac color.|<br>Eosinophil granules are intensely stained with<br>eosin, resulting in a bright red-orange color.|0.8311|\n|Monocytes exhibit a dull, greyish cytoplasm.|Eosinophils display a cytoplasm with a pale pink<br>or slightly orange hue.|0.8247|\n|Basophils have granules that stain metachromati-<br>cally, appearing purple-black.|Eosinophil granules stain specifically with eosin,<br>resulting in a bright orange-red color.|0.8179|\n|Basophils display dark blue or purple granules<br>that often overwhelm the cytoplasm.|Eosinophil granules are characteristically bright<br>pink or red-orange, contrasting with the ba-<br>sophilicgranules of basophils.|0.8092|\n|Monocytes display a folded or indented nuclear<br>membrane.|Eosinophil nuclei are generally round or oval with<br>a smooth, regular membrane.|0.8079|\n|Monocytes exhibit a ”cloud-like” or ”ground<br>glass” appearance to their cytoplasm.|Eosinophil cytoplasm is filled with distinct, re-<br>fractile granules, lacking the diffuse appearance<br>of monocytes.|0.8015|\n|The cytoplasm of a lymphocyte is usually scant<br>and clear.|Eosinophil cytoplasm is plentiful and filled with<br>characteristic red-orange granules.|0.7971|"
],
"file_path": "/Users/theresa/projects/miro_case/periscope/data/2510.15866v1.pdf"
}