{
"text": "Mothman at SemEval-2024 Task 9:\n          An Iterative System for Chain-of-Thought Prompt Optimization\n\n\n                       Alvin Po-Chun Chen and Ray Groshan and Sean von Bayern\n                                          University of Colorado Boulder\n                     {alvin.chen, ray.groshan, sean.vonbayern}@colorado.edu\n\n\n\n\n                          Abstract                       tackle the sentence puzzle subtask. Our system\n                                                                          iteratively optimizes CoT prompting by systemati-\n                 Extensive research exists on the performance        cally evaluating input data and model output using\n                   of large language models on logic-based tasks,                                                 human performance as a benchmark. We identify\n                whereas relatively little has been done on their\n                                                                 question types that are difficult for humans, inform-\n                     ability to generate creative solutions on lateral2024                                                         ing the next iteration of prompt engineering. Not                  thinking tasks.  The BRAINTEASER shared\n                   task tests lateral thinking and uses adversar-       only does this process optimize CoT prompting for\n                       ial datasets to prevent memorization, resulting       a specific task, our system also provides insightsMay             in poor performance for out-of-the-box models.        for improving future data collection and synthesis.\n           We propose a system for iterative, chain-of-        Our main contribution is the novel approach3\n                 thought prompt engineering which optimizes                                                                    for identifying reasoning challenges to optimize\n                prompts using human evaluation. Using this\n                                                            prompting. For the sentence-based task, we de-\n                  shared task, we demonstrate our system’s abil-\n                                                              velop a prompt engineering method which requires                      ity to significantly improve model performance\n               by optimizing prompts and evaluate the input        the model to reason over all answer choices and\n                     dataset.1                                        provide explanations for both correct and incorrect[cs.CL]\n                                                                 choices. In doing so, the model is more likely to\n          1  Introduction                                   refute choices that are semantically related to the\n                                                                question but logically incorrect. Our methodology\n          The ability for language models to reason or pos-                                                                      significantly improves performance for adversar-\n              sess common sense knowledge has become a con-                                                                                ial datasets and achieves more consistent results,\n               troversial topic with far-reaching implications (Ben-                                                        which suggests that the model relies less on memo-\n             der and Koller, 2020).  Large language models                                                                       rization when using these CoT prompts.\n          (LLMs) show remarkable results on vertical think-\n                                                  As part of our evaluation of the data, we also\n             ing tasks that require sequential logical inference\n                                                                       identify several questions in the adversarial datasets\n             (Liu et al., 2019) but there have been relatively few\n                                                                       that are difficult to solve due to having multiple\n              studies done on lateral thinking puzzles—tasks that\n                                                                    logical options or are unanswerable with the pro-\n             require more creative, “outside the box\" problem-\n                                                            vided premises. By combining model reasoning\n             solving processes. As larger LLMs with the ability\n                                                            with human evaluation, we can quickly identifyarXiv:2405.02517v1              to memorize large corpora (Hartmann et al., 2023)\n                                                       and evaluate problematic questions. This process\n              are developed, lateral thinking tasks become an in-\n                                                            can further explain model performance and provide\n              creasingly important benchmark for analyzing and\n                                                            guidance for future data collection/generation.\n             evaluating their reasoning capacities. The BRAIN-\n          TEASER shared task (Jiang et al., 2023)(Jiang et al.,\n                                                 2  Background\n            2024) is designed to elicit and evaluate lateral think-\n             ing through two English-language subtasks, using                                                           Question Answering (QA) is a well-established\n             sentence puzzles and word puzzles respectively.                                                                  task in natural language processing with broad\n                In this paper, we propose a novel method for op-                                                                  applications both in academia and in industry\n             timizing chain-of-thought (CoT) prompting (Wei                                                        (Hirschman and Gaizauskas, 2001). Recent work\n               et al., 2023) on the GPT-4 model which we use to                                                           such as CommonSenseQA (CSQA) (Talmor et al.,\n                                                           2018) and StrategyQA (Geva et al., 2021) focus on                1Our code can be found at https://github.com/alvin-pc-\n                chen/semeval_brainteaser.                             reasoning questions that require logical inference\n\nin the form of vertical thinking. BRAINTEASER     Although the task is designed to elicit lateral\nquestions instead require lateral thinking to answer,    thinking, we consider an alternative understanding\nmuch like questions in the traditional \"brainteaser\"    of the task by thinking of the questions as noisy.\nstyle(Jiang et al., 2023)(Jiang et al., 2024):          Questions are loaded with irrelevant, contradictory,\n                                                   or misleading information to distract the respon-\n     Base:  Samuel  was  out  for  a  walk  when  it    dent. Since transformers generally learn meaning\n     started to rain. He did not have an umbrella   by scoring tokens across the sentence or sentence\n     and he wasn’t wearing a hat. His clothes were    pair, they are biased against long-tail knowledge\n     soaked, yet not a single hair on his head got\n     wet. How could this happen?                    (Li et al., 2023), which is knowledge that occurs\n                                                     infrequently in the training set.\n       1. His hair is dyed.\n                                                        Brainteasers, by their nature, rely on the uncon-       2. This man is bald.\n       3. This man walk upside down to avoid rain.   ventional interpretation of the question to stump the\n       4. None of above.                             respondent. This same property can trick the model\n                                                        into selecting a semantically similar answer choice\n     SR: Rain began to fall as Samuel was taking a\n                                                           that is logically incorrect. Chain-of-Thought (CoT)     stroll. He wasn’t wearing a hat, and he didn’t\n     have an umbrella.  Even though his clothes   prompt engineering (Wei et al., 2023) is a recent\n     were completely drenched, not a single hair   method that has been shown to not only improve\n     on his head was moist.  How is this even\n                                             outcomes on similar problems, but also to provide     possible?\n                                             an interpretable window for human review. CoT\n       1. This man walk upside down to avoid rain.\n                                             prompts provide example questions with related\n       2. His hair is dyed.\n                                                 reasoning to the model, which induces the model\n       3. This man is bald.\n                                                        to provide reasoning for a given answer in the out-       4. None of above.\n                                                          put. We utilize both of these properties to introduce\n     CR: Tom is a clean freak but he never dries   an iterative method that optimizes CoT prompting\n     his hair after a shower. How is this possible?\n                                                        for a given task.\n       1. His hair is dyed.\n       2. He tries to stand upside down during   3  System Overview\n          shower to avoid rain.\n       3. This man is bald.                We propose an iterative system for optimizing the\n       4. None of above.                    CoT prompt engineering process:\n\n  The data for this subtask is drawn from online      1. Randomly sample  the  training  data and\nEnglish-language riddles and brainteasers, with in-        naively engineer CoT prompts.\ncorrect choices created by handpicking entailments\n                                                            2. Identify distinct categories in output reasoning\ngenerated by COMET (Bosselut et al., 2019) using\n                                                             to partition training data.\nincorrect premises. Each question has three unique\nanswers, as well as a shared fourth option, \"None      3. Perform independent human evaluation to iso-\nof above\". To counter memorization from LLMs          late specific challenges in each category.\ntrained on web crawls, the task authors generated\ntwo synthetic datasets using semantic reconstruc-      4. Use findings to inform the development of\ntion (SR) and context reconstruction (CR). The       new CoT prompts.\nSR dataset rephrases the original question with-\n                                                            5. Optionally, identify gaps in the data for future\nout changing the answer or premises while the\n                                                         data collection/synthesis.\nCR dataset changes the situational context without\nchanging the misleading premise. The SR dataset     Each step of our process is iterative, although\nwas generated with an open-source rephrasing tool    independent human evaluation should only be per-\nwhile the CR dataset was generated using GPT-4;   formed when novel problem categories are iden-\nboth sets were manually refined by human anno-    tified in the model reasoning. Once the human\ntators. In total, 208 question/answer pairs were   benchmark has been incorporated into the prompt\nsampled for the base set resulting in 624 questions    engineering process, future iterations mainly rely\nafter SR and CR augmentation. The training set   on evaluating model outputs for gaps in logic. All\nwas split with 81.25% of the data with the same    evaluation steps can provide powerful insights into\nbase/SR/CR questions kept together in the split.      the dataset itself to inform future dataset creation,\n\nand is particularly useful for real-world applica-   and CR lines for human testing. When prompting\ntions where data selection is an open-ended prob-   GPT-4, each question is independently shown to the\nlem. By identifying gaps and problems in the data,   model with no retention in between. Humans are\nmore representative data can be collected to im-   not under similar constraints and can easily identify\nprove model performance on the given application.   reconstructions, especially the SR set which share\nThis can be thought of as a backpropagating human    the same answer choices with the base set. For ac-\nand model outputs back to the prompt engineering    curate comparison, we select different participants\nand data curation steps.                               to answer each dataset.\n                                  We selected 3 participants for each dataset in\n3.1  Naive Chain-of-Thought Prompting                                                   order to collect robust results while still maintain-\nIn the first step, we randomly sample the training    ing consensus. All participants are graduate stu-\ndata to generate naive CoT prompts to use on the    dents with native proficiency in English, and sur-\ntest set. This step eliminates a large portion of the   veys were completed using Google Forms with the\ndataset that naive CoT prompting already solves   same instructions, randomized question order, and\nwhile also providing outputs with interpretable win-   constant answer choice order. An additional option\ndows for identifying problem questions and corre-   \"Unsure\" was provided to uncover difficult ques-\nsponding failure in logic. For example, the topics    tions which was counted as \"None of above\" for\n(mathematics, physics, law, etc.) identified by the    testing purposes.\ntask authors in the training data were found to have    We analyze accuracy along four metrics: mean,\nminimal impact on model accuracy. Instead, we   minimum score, maximum score, and consensus\nfound that the construction type impacted model    score. The minimum score is counted only when\nperformance above all. By focusing on the model     all participants answer correctly whereas the max-\noutputs, we determine that the type of reconstruc-  imum score is counted when any participant an-\ntion (base, SR, and CR) have the highest impact on   swers correctly.  The consensus score uses the\nmodel performance and require human analysis.     answer selected by 2/3 participants; 4 questions\n  For the first round of CoT prompting, we ran-   had no consensus and were marked as incorrect.\ndomly select 8 samples from the training set and   Through this process, we identified common er-\ngenerate the Naive CoT-Base prompt set based    rors for humans and models in each dataset which\non the logical premises of the questions (all naive   informed the second iteration of CoT prompting.\nprompts in Appendices A):\n                                                    3.3  Iterated Chain-of-Thought Prompting   Naive CoT Example Prompt:\nQuestion: A horse is tied to a five-meter rope in   Besides the tricky CR questions uncovered in the\nfront of an old saloon. Ten meters behind the horse   human evaluation step, we also identified that our\nis a bale of hay. Without breaking his rope, the    naive sample was overly weighted on base ques-\nhorse is able to eat the hay whenever he chooses.   tions, which potentially serves to reinforce model\nHow is this possible?                             memorization. To address both issues, we develop\nChoices:                                             the CoT-Mix set, a new set of 8 prompts weighted\n0 = The rope stretches proportionally, providing    towards SR and CR questions and tailored towards\nthe extra length needed for the horse to reach the    disproving incorrect answer choices.  Since our\nhay ten meters away.;                       human benchmark performed particularly poorly\n1 = The rope is not tied to anything else.;        on CR questions, we also separately created CoT\n2 = The walls of the saloon retract or collapse   prompts comprised entirely of base, SR, and CR\ninwards, creating more space for the horse to reach    sets for further comparison. All prompt sets can be\nthe hay.;                                      found in the Appendices B.\n3 = None of above.;                                    Iterated Chain-of-Thought Prompt:\nResponse: That the rope is not tied to anything    Question: A horse is tied to a five-meter rope in\nelse is the simplest choice. The horse can reach    front of an old saloon. Ten meters behind the horse\nthe hay whenever he chooses. The answer is 1        is a bale of hay. Without breaking his rope, the\n                                                     horse is able to eat the hay whenever he chooses.\n3.2  Human Evaluation Step                                                     How is this possible\nBased on model performance using the naive CoT    Choices:\nprompts, we separate the test set along base, SR,   0 = The rope stretches proportionally, providing\n\nInstance Based       Group Based\n      System                                                               Overall\n                              Base  SR  CR  Base&SR  Adversarial\n       abdelhak                 100   100   95.0     100         95.0        98.3\n      Human (Jiang et al., 2023)   90.7   90.7   94.4     90.7         88.9        92.0\n      Human Consensus (Ours)    90.0   90.0   67.5     80.0         55.0        82.5\n       GPT-4 Zero Shot            87.5   72.5   70.0     72.5         60.0        76.7\n       GPT-4 Multi Shot Base      92.5   90.0   80.0     87.5         70.0        87.5\n       GPT-4 Multi Shot Mix       95.0   90.0   85.0     87.5         80.0        90.0\n       GPT-4 Naive CoT-Base      95.0   87.5   75.0     85.0         65.0        85.8\n       GPT-4 Naive CoT-Mix       92.5   87.5   82.5     87.5         75.0        87.5\n       GPT-4 New CoT-Base       97.5   85.0   80.0     85.0         70.0        87.5\n       GPT-4 New CoT-SR         90.0   90.0   75.0     85.0         67.5        85.0\n       GPT-4 New CoT-CR        92.5   90.0   77.5     87.5         67.5        86.7\n       GPT-4 New CoT-Mix        95.0   92.5   82.5     92.5         77.5        90.0\n\nTable 1: Accuracy of each model; Base, SR, and CR are scored on individual datasets, Base&SR only counts if\nboth the base and SR versions are correct for a given question, Adversarial only counts if all three versions are\ncorrect for a given question, and Overall counts base, SR, and CR separately.\n\n\nthe extra length needed for the horse to reach the    choices were multiple sentences long while others\nhay ten meters away.;                          were single words; this discrepancy could poten-\n1 = The rope is not tied to anything else.;            tially affect model performance. Since semicolons\n2 = The walls of the saloon retract or collapse   do not occur in the data at all, they were selected\ninwards, creating more space for the horse to reach    as separators between answer choices for GPT-4\nthe hay.;                                      prompting to mitigate this issue. System prompts\n3 = None of above.;                              can be found in Appendix C.\nResponse: Rope generally cannot stretch, and if it\ncould stretch the length would be variable. If the   5  Results\n\nwalls collapse, the horse would be further from\n                                                    In this section, we compare results across four cat-\nthe hay. The rope not being tied to anything else\n                                                      egories: human performance, zero/multi-shot per-\nis the simplest answer. The answer is 1\n                                                 formance, naive CoT prompt performance, and the\n4  Experimental Setup                            iterated CoT prompt performance. For comple-\n                                                           tion, we also provide the top competition result\nAll experiments were performed using GPT-4 via                                                    (abdelhak). Our official submission for the shared\nthe OpenAI API2 with the same system prefix.                                                     task leaderboard used the GPT-4 New CoT-Base\nEach question was called separately with the re-                                                prompts. With 31 participants, our results scored\nspective prefix. Initial experiments limited token                                          2nd overall on the base data, 7th on SR, CR, and\ncount to 1 in order to force the model to output                                      Base&SR accuracy, 9th on adversarial accuracy,\ninteger labels but the restriction was removed due                                             and 9th overall.\nto poor performance. Output text was logged and\nlabels were extracted deterministically; labels that    5.1  Quantitative Benchmarks\ncould not be extracted this way were reviewed and\n                                      As expected, the new CoT prompts show signif-\nmanually entered. Results shown in this paper were\n                                                      icant improvements along all metrics compared\nfrom API calls between 2024/01/15-2024/02/17;\n                                                      to their naive counterparts.  Since the adversar-\nsince OpenAI models are updated regularly repli-\n                                                                ial datasets are designed specifically to counter-\ncation results may differ.\n                                                      act model memorization, the gains made in the\n  The input data was first preprocessed by remov-\n                                               group-based metrics between the Naive and New\ning extra spaces, lines, punctuation, and spelling\n                                        CoT-Mix prompts in particular demonstrates the\nand grammatical errors. Due to the variety of\n                                                        effectiveness of our system. The CoT-Base sets, on\nsentence-based problems in the data, some answer\n                                                     the other hand, likely still suffer from overweight-\n   2https://platform.openai.com/                    ing on the original questions crawled from online\n\nsources. The fact that multi-shot prompting out-   influenced by several factors. A major factor is the\nperforms the Naive CoT prompts further supports    fact that we use independent human annotators for\nthis argument. Despite not receiving any guidance   each of the datasets, meaning that those working on\non logic, the model is still able to achieve strong    the CR set have no reference to the original ques-\nresults on the task. However, once we introduce    tion. For questions with multiple valid answers\nthe idea of disproving incorrect answers, the model    or unclear logic, our annotators would not be able\nis once again able to make gains in performance.     to reference the base and SR versions for clues.\n   Interestingly, the SR and CR prompts did not   Out of 14 incorrectly answered CR questions, we\nshow significant improvements compared to the    identify 5 such questions.\nbase set and even performed worse on the CR ques-      Specifically, we discovered several questions\ntions.  This could potentially be due to the fact    in the CR set with multiple logical responses. In\nthat the model performs worse on these question    the example below, the correct answer is \"two\ntypes overall. Without base questions to provide   and a half hours\" with the assumption that each\na foundation, the model is unable to generate the    stop is meant to take half an hour. Ignoring that\nmost robust reasoning. While this finding provides    the premise itself is nonsensical (the driver would\ngrounds for further exploration, the results from   have simply been told to stop for the full two and\nthe New CoT-Mix prompting shows consistent im-   a half hours), nowhere is it stated that the driver\nprovements across the board, suggesting that there    takes half an hour for each break. As a result, both\nare commonalities within each adversarial dataset    (2.) and (4.) are viable candidates depending on\nthat can be identified by the model.                  reasoning. The rest of the problem questions can\n                                              be seen in Appendix D.\n5.2  Human Performance Evaluation\n                                                     Example Question: A driver is told to make a stop\n\n                                                     every half an hour for the engine to cool down,\n    Dataset  Mean  Min.  Con.  Max.\n                                                     for five times. How long do the stops take?\n    Base      84.2    65.0   87.5   100.0\n                                                     Choices:\n   SR        85.8    70.0   90.0   97.5\n                                                     1. Three hours.\n   CR        60.0    30.0   65.0   80.0\n                                                     2. Two and a half hours.\nTable 2: Human participant accuracy for each dataset;    3. Two hours.\nMin. is only counted when all three participants answer    4. None of above.\ncorrectly, Con. is counted when 2/3 agree on an answer,\nand Max. is counted when any participant scores cor-\nrectly.                                       6  Conclusions\n\n  When evaluating human performance, we find    In this paper, we demonstrate a novel system for\nthat there were significantly higher rates of \"Un-   optimizing chain-of-thought prompt engineering\nsure\" answers in the CR set which contributes to    using human evaluation. While Naive CoT prompts\nthe lower overall score. Along with other obser-   performed similarly to multi-shot prompting with-\nvations, the greater rate of \"Unsure\" answers sup-   out guidance on reasoning, later iterations were\nports the idea that the CR questions are more diffi-   able to approach state-of-the-art performance. Sig-\ncult to reason over. However, there were no cases    nificant improvement on the SR, CR, and group-\nwhere all respondents selected \"Unsure\" for the   based metrics were shown on the test data, support-\nsame question, making this metric a weak indicator    ing the adoption for this method of prompt engi-\nof problematic questions. One possible explanation    neering. This system further provides guidance on\nsuggests that the wording for the answers in the CR    identifying key problem areas in the dataset, specif-\nset are less well-formed than the other sets, leading    ically with regards to the generation of context\nto greater confusion among respondents.             reconstruction questions. This form of evaluation\n  For human performance, none of our CoT results    serves to inform decisions for improving dataset\nwere able to beat the task paper human benchmark    quality. For future work, we plan to implement\non the CR dataset, although our iterated CoT re-    different techniques to create synthetic data and\nsults did surpass the human benchmark on SR. Our   perform the same evaluation across an open-ended\nhuman results only drastically differ on the CR set    dataset.\nwith those found in the task paper, which could be\n\nReferences                     A  Naive CoT Prompts\n\nEmily M. Bender and Alexander Koller. 2020. Climbing\n                                            A.1  Naive Base Prompts  towards NLU: On meaning, form, and understanding\n   in the age of data. In Proceedings of the 58th Annual                                                            1. Question: Samuel was out for a walk when it\n  Meeting of the Association for Computational Lin-\n                                                             started to rain. He did not have an umbrella   guistics, pages 5185–5198, Online. Association for\n  Computational Linguistics.                           and he wasn’t wearing a hat. His clothes were\n                                                      soaked, yet not a single hair on his head got\nAntoine Bosselut, Hannah Rashkin, Maarten Sap, Chai-\n                                                        wet. How could this happen?  tanya Malaviya, Asli Celikyilmaz, and Yejin Choi.\n  2019. COMET: Commonsense transformers for auto-        Choices:\n   matic knowledge graph construction. In Proceedings       0 = His hair is dyed.;\n   of the 57th Annual Meeting of the Association for                                               1 = This man is bald.;\n  Computational Linguistics, pages 4762–4779, Flo-\n                                                2 = This man walk upside down to avoid rain.;   rence, Italy. Association for Computational Linguis-\n   tics.                                          3 = None of above.;\n                                                   Response: Samuel got wet from the rain, but\nMor Geva, Daniel Khashabi, Elad Segal, Tushar Khot,\n                                              no hair on his head got wet. If Samuel dyed  Dan Roth, and Jonathan Berant. 2021. Did aristotle\n  use a laptop? a question answering benchmark with         his hair it would still be wet. Samuel is bald,\n   implicit reasoning strategies.                           so his hair didn’t get wet. The answer is 1\n\nValentin Hartmann, Anshuman Suri, Vincent Bind-\n   schaedler, David Evans, Shruti Tople, and Robert      2. Question: A horse is tied to a five-meter rope\n  West. 2023. Sok: Memorization in general-purpose         in front of an old saloon. Ten meters behind\n   large language models.                                  the horse is a bale of hay. Without breaking\nL. Hirschman and R. Gaizauskas. 2001. Natural lan-         his rope, the horse is able to eat the hay when-\n  guage question answering: the view from here. Natu-        ever he chooses. How is this possible?\n   ral Language Engineering, 7(4):275–300.                                                      Choices:\nYifan Jiang,  Filip  Ilievski, and Kaixin Ma. 2024.       0 = The rope stretches proportionally, provid-\n  Semeval-2024 task 9:  Brainteaser: A novel task        ing the extra length needed for the horse to\n  defying common sense.   In Proceedings of the                                                      reach the hay ten meters away.;\n  18th International Workshop on Semantic Evalua-\n                                               1 = The rope is not tied to anything else.;   tion (SemEval-2024), pages 1996–2010, Mexico City,\n  Mexico. Association for Computational Linguistics.       2 = The walls of the saloon retract or collapse\n                                                       inwards, creating more space for the horse to\nYifan Jiang, Filip Ilievski, Kaixin Ma, and Zhivar\n   Sourati. 2023. BRAINTEASER: Lateral thinking        reach the hay.;\n   puzzles for large language models. In Proceedings       3 = None of above.;\n   of the 2023 Conference on Empirical Methods in        Response: That the rope is not tied to any-\n  Natural Language Processing, pages 14317–14332,                                                        thing else is the simplest choice. The horse\n  Singapore. Association for Computational Linguis-\n                                                  can reach the hay whenever he chooses. The   tics.\n                                                  answer is 1\nHuihan Li, Yuting Ning, Zeyi Liao, Siyuan Wang, Xi-\n  ang Lorraine Li, Ximing Lu, Faeze Brahman, Went-\n                                                            3. Question: A woman who lives in new york   ing Zhao, Yejin Choi, and Xiang Ren. 2023.  In\n   search of the long-tail: Systematic generation of long-         legally married three men, she did not get di-\n   tail knowledge via logical rule guided search.              vorce, get an enrollment, or legally seperate.\n                                     How is this possible?Yinhan Liu, Myle Ott, Naman Goyal, Jingfei Du, Man-\n   dar Joshi, Danqi Chen, Omer Levy, Mike Lewis,        Choices:\n  Luke Zettlemoyer, and Veselin Stoyanov. 2019.       0 = The woman is not a good person.;\n  Roberta: A robustly optimized bert pretraining ap-                                               1 = His husband is not a good husband.;\n   proach.\n                                               2 = She is a minister.;\nAlon Talmor, Jonathan Herzig, Nicholas Lourie, and       3 = None of above.;\n  Jonathan Berant. 2018. Commonsenseqa: A question                                                   Response: In new york it is not legal to be\n  answering challenge targeting commonsense knowl-\n   edge. CoRR, abs/1811.00937.                          married to more than one person at a time. If\n                                                           the woman did not get divorced or legally sep-\nJason Wei, Xuezhi Wang, Dale Schuurmans, Maarten\n                                                             arated, she cannot be legally married to more  Bosma, Brian Ichter, Fei Xia, Ed Chi, Quoc Le, and\n  Denny Zhou. 2023. Chain-of-thought prompting elic-        than one person. Ministers perform marriages,\n   its reasoning in large language models.                    they do not get married. The answer is 2\n\n4. Question: Why is the value of 1968 pennies         nually, so it depends on their life span.;\n   higher than 1967 pennies?                      1 = They technically only have one birth day\n   Choices:                                              in their lifetime.;\n  0 = Old money weight more than new money.;       2 = It can be zero as some people are too busy\n  1 = Old money is dirtier than new money.;            to celebrating their birthdays.;\n  2 = Because there is one more penny in 1968       3 = None of above.;\n   pennies than in 1967 pennies.;                     Response: Everyone is born only once so tech-\n  3 = None of above.;                                    nically the average person has one birthday in\n   Response: 1968 and 1967 refer to the num-         their lifetime. The answer is 1\n   ber of pennies. The value of 1968 pennies\n                                                          8. Question: The more you take, the more you\n    is higher than 1967 pennies because there is\n                                                       leave behind\n   one more penny in 1968 pennies than in 1967\n                                                    Choices:\n   pennies. The answer is 2\n                                              0 = Love.;\n5. Question: Not a single parent objected when       1 = Footsteps.;\n   the teacher spanked every child in the class.       2 = Money.;\n  How come?                                  3 = None of above.;\n   Choices:                                        Response: Footsteps. The more you walk, the\n  0 = The teacher had informed all the parents       more footsteps you leave behind. The answer\n   in advance about the unique disciplinary ap-          is 1\n   proach.;\n                                          A.2  Naive Mixed Prompts\n  1 = The teacher had informed all the children\n                                                          1. Question: A horse is tied to a five-meter rope   in advance about the unique disciplinary ap-\n                                                         in front of an old saloon. Ten meters behind   proach.;\n                                                       the horse is a bale of hay. Without breaking  2 = The teacher was in an orphanage school.;\n                                                            his rope, the horse is able to eat the hay when-  3 = None of above.;\n                                                      ever he chooses. How is this possible?   Response: Even if the teacher had informed\n                                                    Choices:    all the parents or all the students in advance\n                                              0 = The rope stretches proportionally, provid-   about the unique disciplinary approach, it is\n                                                    ing the extra length needed for the horse to   unlikely that nobody would object.  If the\n                                                     reach the hay ten meters away.;   teacher is in an orphange school, there would\n                                             1 = The rope is not tied to anything else.;   be no parents to object. The answer is 2\n                                              2 = The walls of the saloon retract or collapse\n6. Question: Twenty-seven ducks are going to        inwards, creating more space for the horse to\n   the pond. Five of them got lost, thirteen of        reach the hay.;\n  them are staying home, and nine of them are       3 = None of above.;\n   at the pond. Where are the rest of them?            Response: Rope generally cannot stretch, and\n   Choices:                                                            if it could stretch the length would be variable.\n  0 = Home.;                                                  If the walls collapse, the horse would be fur-\n  1 = The way to the pond.;                             ther from the hay. The rope not being tied\n  2 = Pond.;                                            to anything else is the simplest answer. The\n  3 = None of above.;                             answer is 1\n   Response: Twenty-seven ducks are going to\n                                                          2. Question: A woman who lives in new york   the pond. Five of them are lost, 27 - 5 = 22.\n                                                          legally married three men, she did not get   Thirteen of them are staying home, 22 - 13\n                                                          divorce, get an enrollment, or legally seperate.  = 9. Nine of them are at the pond, 9 - 9 = 0.\n                                    How is this possible?  There are no more ducks so the question is\n                                                    Choices:   invalid. The answer is 3\n                                              0 = The woman is not a good person.;\n7. Question: How many birth days does the av-       1 = His husband is not a good husband.;\n   erage person have?                            2 = She is a minister.;\n   Choices:                                    3 = None of above.;\n  0 = People may celebrate their birthdays an-       Response: In new york it is not legal to be\n\nmarried to more than one person at a time,      5. Question: I excavate little caves and keep my\n   even if her husband is bad.  If the woman        gold and silver there. I also create gold crowns\n   did not get divorced or legally separated, she       and silver bridges. They are the tiniest things\n   cannot be legally married to more than one       you can imagine. Everyone will eventually\n   person. Ministers perform marriages, they do         require my assistance, but many people are\n   not get married. The answer is 2                      reluctant to accept it. Why?\n                                                    Choices:\n3. Question: Brad began by entering the office       0 = I am a dentist.;\n   tower’s 22nd story through the filthy common       1 = I am a thief.;\n  window. He slid the window open and leapt       2 = I am a miner.;\n   through it after becoming depressed. Outside       3 = None of above.;\n   the building, there was a cliff-like drop to the        Response: Thieves and miners do not create\n   ground. Amazingly, he came to rest entirely        gold crowns or bridges.  Tiny crowns and\n   unharmed. How could he have survived the        bridges are dental work. People don’t like\n    fall if there was nothing to slow or cushion his        going to the dentist. The answer is 0\n   descent?\n   Choices:                                             6. Question: Each of the 30 participants in the\n  0 = Brad was so sick and tired of window        masquerade had to wear a unique hat to distin-\n   washing, he opened the window and jumped        guish themselves from one another. The host,\n   inside.;                                         however, only tallied 29 when he counted\n  1 = The ground outside the building is wet.;          the number of hats to determine attendance.\n  2 = Consistent exercise has made him a very        All 30 persons had signed their names on\n   strong man.;                                        the spreadsheet, which confused him. He re-\n  3 = None of above.;                               peated the count. There are still 29. How is\n   Response: Even very strong men would not         that even doable?\n   survive a fall from a 22-story building. The        Choices:\n   ground outside the building being wet would       0 = One person had a pretty beautiful hat.;\n   not cushion his fall. Brad was so sick and tired       1 = The host had a hat himself and he forget\n   of window washing, he opened the window         to count it.;\n   and jumped inside. The answer is 0              2 = One person had moved away from the\n                                                 group when the host was counting.;\n4. Question: Danny had just passed under an       3 = None of above.;\n   overpass in his semi when he abruptly came        Response: If one person had a pretty beau-\n   to a stop. Danny accidentally drove under the          tiful hat, then the host would still count 30\n   overpass that was only just tall enough for          hats. If one person had moved away from the\n   his truck because he wasn’t paying enough       group when the host was counting, then the\n   attention. He was unable to move forward or        host would still count 30 hats. The host had\n   backward in the semi due to how tightly it was        a hat himself and he forget to count it. The\n  wedged. When another tracker passed by, he        answer is 1\n  was told how simple it would be to remove\n   the semi from underneath the bridge. What      7. Question: A certain kind of animal has par-\n   did he recommend?                                  ents but no children, lives happily but can not\n   Choices:                                          give birth to offspring. This kind of animal\n  0 = He told Danny to left the bridge.;               has existed on earth for a long history. How is\n  1 = He told Danny to overturn the track.;              that possible?\n  2 = He told Danny to let some air out of his        Choices:\n    tires.;                                      0 = The animal is the dinosaur. Millions of\n  3 = None of above.;                                years ago, dinosaurs roamed the Earth, but\n   Response: The bridge would not be lifted.         eventually, they became extinct due to various\n   Overturning the truck would not help. Letting         factors such as climate change or asteroid im-\n  some air out of his tires would help. The          pact.;\n   answer is 2                                 1 = The animal is the butterfly. During the\n\npupal stage of their life cycle, butterflies are       3 = None of above.;\n     inside a protective casing, and it may appear        Response: The couple are standing on the\n     as if they have completely disappeared or been       same mat but cannot see each other, which\n    wiped out.;                                        suggests that there is a barrier between them.\n    2 = The animal is the Mule. Since all Mules        Regardless of how the mat was folded,  it\n     are born sterile, you can only get a Mule by       would not prevent the couple from seeing each\n     crossing a donkey with a horse.;                       other. Even if the woman turned her back to\n    3 = None of above.;                                  the man he would still see her. Therefore, the\n    Response: Dinosaurs are no longer alive, so        couple was standing on two sides of a door,\n     they cannot live happily. Butterflies can give       which had a rug under it. The answer is 2\n     birth to offspring, so they are not the answer.\n                                                            2. Question: Eight people were sitting under a    Mules are born sterile, so they cannot give\n                                                          large tree. Suddenly, a gust of wind blows,     birth to offspring. The answer is 2\n                                                          yet none of them got hit by any falling leaves.\n  8. Question: Six women were hiking on a trail      How is this possible?\n    when a sudden snowfall began. Five of the        Choices:\n   women hurried along, but the sixth did not.       0 = It was winter and the tree doesn’t have any\n      Still, they all reached the cabin at the same          leaves.;\n     time, and all but the sixth were cold. How is       1 = People were camping under the tree.;\n     that possible?                                2 = The wind blows heavily.;\n     Choices:                                    3 = None of above.;\n    0 = The 6th woman beated them at the end.;        Response:  If the people were camping un-\n    1 = The sixth woman was in a photograph that        der the tree, they would still be hit by the\n    one of the others was carrying.;                        falling leaves.  The wind blowing heavily\n    2 = The 6th woman walked slowly to dodge       would cause the leaves to fall. If it was winter\n     the snow.;                                    and the tree doesn’t have any leaves, then the\n    3 = None of above.;                               people would not be hit by any falling leaves.\n    Response: If the sixth woman beat them or       The answer is 0\n    walked slowly to dodge the snow she would\n                                                            3. Question: The ship was in the central Pacific     not have reached the cabin at the same time.\n                                                   Ocean. The ship suddenly began to sink with-      If the sixth woman was in a photograph that\n                                                      out being crushed. However, each team was    one of the others was carrying, then she would\n                                                                             still preoccupied with its own tasks, so none     not be cold and would not have to hurry. The\n                                              was threatening. Why?    answer is 1\n                                                      Choices:\nB  New CoT Prompts                          0 = An underwater earthquake caused a rapid\n                                                    drop in the water level and resulted in the lossB.1  New Base Prompts\n                                                         of buoyancy for the ship.;\n  1. Question: A couple is having a disagreement                                               1 = It was a Submarine.;\n     over the man’s error. The man kept apologiz-                                               2 = There are too many fish around the ship.;\n     ing and pleading with the woman to allow him                                               3 = None of above.;\n     to see her directly. The woman was still upset.                                                     Response: An earthquake would cause people\n    Thus, she wouldn’t agree. The couple, though,                                                           to feel threatened, and fish around the ship\n    was positioned on the same mat. How is that                                              would not matter. If the ship were a subma-\n    even doable?                                                                   rine, it would be designed to sink. The answer\n     Choices:                                                                       is 1\n    0 = The mat was folded in multiple times and\n    end up with a special shape.;                        4. Question: Two mothers and two daughters\n    1 = The woman kept turning her back to the       were asking for new state IDs, but the agent\n    man.;                                            only gave out three forms and instructed them\n    2 = The couple was standing on two sides of       on how to fill them out. Why?\n     the girl’s apartment door, which had a rug un-        Choices:\n     der it.;                                     0 = They are one daughters, one mother and\n\none grandmother.;                                 has existed on earth for a long history. How is\n  1 = Two girls filled the from together.;                 that possible?\n  2 = One mother is too old to apply for new        Choices:\n   IDs.;                                      0 = The animal is the dinosaur. Millions of\n  3 = None of above.;                                years ago, dinosaurs roamed the Earth, but\n   Response: The agent only gave out three         eventually, they became extinct due to various\n   forms and instructed them on how to fill them         factors such as climate change or asteroid im-\n   out, which suggests that there are only three          pact.;\n   people. If they are one daughter, one mother,       1 = The animal is the butterfly. During the\n  and one grandmother, then there would be        pupal stage of their life cycle, butterflies are\n   three people. The answer is 0                        inside a protective casing, and it may appear\n                                                        as if they have completely disappeared or been\n5. Question: Every night, a man would sleep                                               wiped out.;\n   with a light on, as bright as the sun, dazzling                                             2 = The animal is the Mule. Since all Mules\n   the neighbors.  But why did his neighbors                                                       are born sterile, you can only get a Mule by\n   never complain?                                                       crossing a donkey with a horse.;\n   Choices:                                              3 = None of above.;\n  0 = All his neighbors are blind.;                                                 Response: Dinosaurs are no longer alive, so\n  1 = The man would wake up early.;                                                     they cannot live happily. Butterflies can give\n  2 = He lived in a light house.;                                                           birth to offspring, so they are not the answer.\n  3 = None of above.;                                             Mules are born sterile, so they cannot give\n   Response: If all his neighbors are blind, they                                                            birth to offspring. The answer is 2\n  would not be dazzled by the light. If the man\n   lived in a light house then the light would be      8. Question: Six women were hiking on a trail\n   expected. The answer is 2                    when a sudden snowfall began. Five of the\n                                      women hurried along, but the sixth did not.\n6. Question: Each of the 30 participants in the\n                                                                      Still, they all reached the cabin at the same\n   masquerade had to wear a unique hat to distin-\n                                                       time, and all but the sixth were cold. How is\n   guish themselves from one another. The host,\n                                                             that possible?\n   however, only tallied 29 when he counted\n                                                    Choices:\n   the number of hats to determine attendance.\n                                              0 = The 6th woman beated them at the end.;\n   All 30 persons had signed their names on\n                                              1 = The sixth woman was in a photograph that\n   the spreadsheet, which confused him. He re-\n                                               one of the others was carrying.;\n   peated the count. There are still 29. How is\n                                             2 = The 6th woman walked slowly to dodge\n   that even doable?\n                                                        the snow.;\n   Choices:\n                                              3 = None of above.;\n  0 = One person had a pretty beautiful hat.;\n                                                 Response: If the sixth woman beat them or\n  1 = The host had a hat himself and he forget\n                                               walked slowly to dodge the snow she would\n   to count it.;\n                                                    not have reached the cabin at the same time.\n  2 = One person had moved away from the\n                                                                   If the sixth woman was in a photograph that\n   group when the host was counting.;\n                                                one of the others was carrying, then she would\n  3 = None of above.;\n                                                     not be cold and would not have to hurry. The\n   Response: If one person had a pretty beau-\n                                                answer is 1\n    tiful hat, then the host would still count 30\n   hats. If one person had moved away from the                                            B.2  New Mixed Prompts\n   group when the host was counting, then the\n                                                          1. Question: A horse is tied to a five-meter rope   host would still count 30 hats. The host had\n                                                         in front of an old saloon. Ten meters behind   a hat himself and he forget to count it. The\n                                                       the horse is a bale of hay.  Without break-   answer is 1\n                                                    ing his rope, the horse is able to eat the hay\n7. Question: A certain kind of animal has par-       whenever he chooses. How is this possible?\n   ents but no children, lives happily but can not        Choices:\n   give birth to offspring. This kind of animal       0 = The rope stretches proportionally, provid-\n\ning the extra length needed for the horse to         attention. He was unable to move forward or\n   reach the hay ten meters away.;                   backward in the semi due to how tightly it was\n  1 = The rope is not tied to anything else.;           wedged. When another tracker passed by, he\n  2 = The walls of the saloon retract or collapse       was told how simple it would be to remove\n   inwards, creating more space for the horse to         the semi from underneath the bridge. What\n   reach the hay.;                                     did he recommend?\n  3 = None of above.;                               Choices:\n   Response: That the rope is not tied to any-       0 = He told Danny to left the bridge.;\n   thing else is the simplest choice. The horse       1 = He told Danny to overturn the track.;\n   can reach the hay whenever he chooses. The       2 = He told Danny to let some air out of his\n   answer is 1                                                     tires.;\n                                              3 = None of above.;\n2. Question: A woman who lives in new york                                                  Response: Danny has to reduce the height of\n   legally married three men, she did not get                                                         his truck to pass the bridge. Letting the air\n   divorce, get an enrollment, or legally seperate.                                                       out of his tires reduces the truck’s height. The\n  How is this possible?                                                answer is 2\n   Choices:\n  0 = The woman is not a good person.;              5. Question: I excavate little caves and keep my\n  1 = His husband is not a good husband.;             gold and silver there. I also create gold crowns\n  2 = She is a minister.;                           and silver bridges. They are the tiniest things\n  3 = None of above.;                           you can imagine. Everyone will eventually\n   Response: In new york it is not legal to be         require my assistance, but many people are\n   married to more than one person at a time.         reluctant to accept it. Why?\n   Ministers perform marriages, they do not get        Choices:\n   married. The answer is 2                       0 = I am a dentist.;\n                                             1 = I am a thief.;\n                                              2 = I am a miner.;\n3. Question: Brad began by entering the office                                              3 = None of above.;\n   tower’s 22nd story through the filthy common                                                   Response: Tiny crowns and bridges are dental\n  window. He slid the window open and leapt                                                 work. People don’t like going to the dentist.\n   through it after becoming depressed. Outside                                            The answer is 0\n   the building, there was a cliff-like drop to the\n   ground. Amazingly, he came to rest entirely      6. Question: Each of the 30 participants in the\n   unharmed. How could he have survived the        masquerade had to wear a unique hat to distin-\n    fall if there was nothing to slow or cushion his        guish themselves from one another. The host,\n   descent?                                        however, only tallied 29 when he counted\n   Choices:                                           the number of hats to determine attendance.\n  0 = Brad was so sick and tired of window        All 30 persons had signed their names on\n   washing, he opened the window and jumped         the spreadsheet, which confused him. He re-\n   inside.;                                          peated the count. There are still 29. How is\n  1 = The ground outside the building is wet.;           that even doable?\n  2 = Consistent exercise has made him a very        Choices:\n   strong man.;                                 0 = One person had a pretty beautiful hat.;\n  3 = None of above.;                           1 = The host had a hat himself and he forget\n   Response: A person cannot jump out of a 22         to count it.;\n   story building without injury. Brad must have       2 = One person had moved away from the\n  jumped into the building. The answer is 0          group when the host was counting.;\n                                              3 = None of above.;\n4. Question: Danny had just passed under an                                                 Response: The host is the one counting the\n   overpass in his semi when he abruptly came                                                              hats. The host had a hat himself and he forget\n   to a stop. Danny accidentally drove under the                                                           to count it. The answer is 1\n   overpass that was only just tall enough for\n   his truck because he wasn’t paying enough      7. Question: A certain kind of animal has par-\n\nents but no children, lives happily but can not       and with the announcements, gathered a lot\n     give birth to offspring. This kind of animal        of people. There were many great players\n     has existed on earth for a long history. How is       from basketball, volleyball, football, and even\n     that possible?                                 swimmers, But Mark directly went to the\n     Choices:                                              footballer and took a photo with him. How\n    0 = The animal is the dinosaur. Millions of        did he know who was the person that people\n     years ago, dinosaurs roamed the Earth, but        got excited for in the first place?\n     eventually, they became extinct due to various       \"Since the playground was a  football\n     factors such as climate change or asteroid im-       playground and the other players could’ve\n      pact.;                                         not been playing in the playground at the\n    1 = The animal is the butterfly. During the        time of the announcement.\",\n    pupal stage of their life cycle, butterflies are        \"Since Mark was a crazy fan of football, only\n     inside a protective casing, and it may appear        a football player can be considered as great\n     as if they have completely disappeared or been         player in his mind.\",\n    wiped out.;                                      \"Since Mark stood closest to the football\n    2 = The animal is the Mule. Since all Mules         players, he only focused on football players\n     are born sterile, you can only get a Mule by       and didn’t notice others.\",\n     crossing a donkey with a horse.;                 \"None of above.\"\n    3 = None of above.;\n    Response: The animal is still alive, has par-\n                                                            2. SP-30_CR: Why do old people consume      ents, but cannot have children. Mules are born\n                                              more food than young people.      sterile, so they cannot give birth to offspring.\n                                                    \"Older  adults may have  specific  dietary    The answer is 2\n                                                      requirements to address age-related issues\",\n  8. Question: Six women were hiking on a trail        \"Older people  require  increased  nutrient\n    when a sudden snowfall began. Five of the         intake to support overall health and well-\n   women hurried along, but the sixth did not.         being.\",\n      Still, they all reached the cabin at the same       \"Because older people live longer.\",\n     time, and all but the sixth were cold. How is       \"None of above.\"\n     that possible?\n     Choices:\n                                                            3. SP-184_CR: Five people were at a football    0 = The 6th woman beated them at the end.;\n                                                     match, and a sudden shower started. The four    1 = The sixth woman was in a photograph that\n                                                              that rushed to take cover still got soaked, but    one of the others was carrying.;\n                                                         the one who didn’t move stayed completely    2 = The 6th woman walked slowly to dodge\n                                                              dry. Why didn’t he get wet?     the snow.;\n                                               \"The man is an excellent football player that    3 = None of above.;\n                                                   can avoid rain in high speed.\"    Response: All the women hurried except the\n                                               \"The man was lucky enough to avoid all the     sixth and were cold. The sixth woman is not\n                                                                 rain.     physically present. She must be in a photo-\n                                       \"He was a photograph, the other people    graph one of the others was carrying. The\n                                              were there to honor a former player.\",    answer is 1\n                                              \"None of above.\"\nC  System and User Prompts\n\n\"role\": \"system\", \"content\": \"You are a Question                                                            4. SP-166_CR: A farmer has 11 sheep. Half of\nAnswering Model that answers questions by find-                                               them are white. How is this possible?\ning logical entailments between the question and                                             \"One sheep is regarded as both white and\nanswer choices.\"                                                         other colors same time.\",\n                                         \"A famer raises his sheep in both white way\nD  Problematic CR Questions\n                                                 and another way.\",\n  1. SP-120_CR: Mark was in a playground where       \"They are all white.\",\n    somebody noticed a great player playing       \"None of above.\"\n\n5. SP-156_CR: A driver is told to make a stop\n   every half an hour for the engine to cool\n  down, for five times. How long do the stops\n   take?\n   \"Three hours.\"\n  \"Two and a half hours.\",\n  \"Two hours.\",\n  \"None of above.\"",
"headers": [
"arXiv:2405.02517v1  [cs.CL]  3 May 2024",
"Mothman at SemEval-2024 Task 9:",
"An Iterative System for Chain-of-Thought Prompt Optimization"
],
"tables": [
"|System|Instance Based<br>Base SR CR|Group Based<br>Base&SR Adversarial|Overall|\n|---|---|---|---|\n|abdelhak|100<br>100<br>95.0|100<br>95.0|98.3|\n|Human (Jiang et al., 2023)<br>Human Consensus(Ours)|90.7<br>90.7<br>94.4<br>90.0<br>90.0<br>67.5|90.7<br>88.9<br>80.0<br>55.0|92.0<br>82.5|\n|GPT-4 Zero Shot<br>GPT-4 Multi Shot Base<br>GPT-4 Multi Shot Mix|87.5<br>72.5<br>70.0<br>92.5<br>**90.0**<br>80.0<br>**95.0**<br>**90.0**<br>**85.0**|72.5<br>60.0<br>**87.5**<br>70.0<br>**87.5**<br>**80.0**|76.7<br>87.5<br>**90.0**|\n|GPT-4 Naive CoT-Base<br>GPT-4 Naive CoT-Mix|**95.0**<br>**87.5**<br>75.0<br>92.5<br>**87.5**<br>**82.5**|85.0<br>65.0<br>**87.5**<br>**75.0**|85.8<br>**87.5**|\n|GPT-4 New CoT-Base<br>GPT-4 New CoT-SR<br>GPT-4 New CoT-CR<br>GPT-4 New CoT-Mix|**97.5**<br>85.0<br>80.0<br>90.0<br>90.0<br>75.0<br>92.5<br>90.0<br>77.5<br>95.0<br>**92.5**<br>**82.5**|85.0<br>70.0<br>85.0<br>67.5<br>87.5<br>67.5<br>**92.5**<br>**77.5**|87.5<br>85.0<br>86.7<br>**90.0**|"
],
"file_path": "/Users/theresa/projects/miro_case/periscope/data/2405.02517v1.pdf"
}